[
  {
    "رقم الباب": 0,
    "اسم الباب": "الديباجة",
    "رقم الفصل": 0,
    "اسم الفصل": "الديباجة",
    "رقم المادة": 0,
    "نص المادة": "الشّعب الجزائريّ شعب حرّ، ومصمّم على البقاء حرّا.\nفتاريخه الممتدة جذوره عبر آلاف السنين سلسلة متصلة الحلقات من الكفاح والجهاد، جعلت الجزائر دائما منبت الحرّيّة، وأرض العزّة والكرامة.\nلقد عرفت الجزائر في أعزّ اللّحظات الحاسمة الّتي عاشها حوض البحر الأبيض المتوسّط، كيف تجد في أبنائها، منذ العهد النّوميديّ، والفتح الإسلاميّ، حتّى الحروب التّحريريّة من الاستعمار، روّادا للحرّيّة، والوحدة والرّقيّ، وبناة دول ديمقراطيّة مزدهرة، طوال فترات المجد والسّلام.\nوكان أوّل نوفمبر 1954 وبيانه المؤسس نقطتي تحوّل فاصلة في تقرير مصيرها وتتويجا عظيما لمقاومة ضروس، واجهت بها مختلف الاعتداءات على ثقافتها، وقيمها، والمكوّنات الأساسيّة لهوّيّتها، وهي الإسلام والعروبة والأمازيغيّة، التي تعمل الدولة دوما لترقية وتطوير كل واحدة منها، وتمتدّ جذور نضالها اليوم في شتّى الميادين في ماضي أمّتها المجيد.\nلقد تجند الشّعب الجزائريّ وتوحد في ظلّ الحركة الوطنيّة، ثمّ انضوى تحت لواء جبهة التّحرير الوطنيّ التاريخية، وقدّم تضحيات جساما من أجل أن يتكفّل بمصيره الجماعيّ في كنف الحرّيّة والهوّيّة الثّقافيّة الوطنيّة المستعادتين، ويشيّد مؤسّساته الدّستوريّة الشّعبيّة الأصيلة.\nوقد توّج الشعب الجزائري، تحت قيادة جبهة التّحرير الوطنيّ وجيش التحرير الوطني، ما بذله خيرة أبناء الجزائر من تضحيات في الحرب التّحريريّة الشّعبيّة بالاستقلال، وشيّد دولة عصريّة كاملة السّيادة.\nإن عزم الشعب الجزائري على تحقيق انتصارات مصيرية، سمح باسترجاع سيادته وثرواته الوطنية وبناء الدولة لخدمته وحده، وكذا تعزيز شرعية الدولة التي تمارس سلطاتها خدمة للاستقلال الوطني وبعيدا عن كل ضغط خارجي.\nلقد عززت مقاومة الشعب الجزائري ضد المحاولات العنيفة التي هددت وحدة واستقرار الدولة، تمسكه بقيم التسامح والسلم. وقـــرر بفضـــل إيمانـــه وتمسكـــه الثابت بوحدتـــه وبكــل سيادة تحقيق سياسة السلم والمصالحة الوطنية التي أعطت ثمارها وهو مصمم على الحفاظ عليها.\nإنّ الشعب عازم على جعل الجزائر في منأى عن الفتنة والعنف وعن كل تطرف، وعن خطابات الكراهية وكل أشكال التمييز مــن خـــلال ترسيـــخ قيمـــه الروحيـــة والحضاريـــة القائمـــة على الحـــوار والمصالحـــة والأخـــوة، في ظـــل احتـــرام الدستـــور وقوانــين الجمهورية.\nيُعبّر الشعب عن حرصه لترجمة طموحاته في هذا الدستور بإحداث تحولات اجتماعية وسياسية عميقة من أجل بناء جزائر جديدة، طالب بها سلميا من خلال الحراك الشعبي الأصيل الذي انطلق في 22 فبراير2019.\nإنّ الشعب الجزائري ناضل ويناضل دوما في سبيل الحرية والديمقراطية، وهو متمسك بسيادته واستقلاله الوطنيين، ويعتزم أن يبني بهذا الدستور مؤسسات، أساسها مشاركة كل المواطنين والمجتمع المدني، بما فيه الجالية الجزائرية في الخارج، في تسيير الشؤون العمومية، والقدرة على تحقيق العدالة الاجتماعية والمساواة وضمان الحرية لكل فرد، في إطار دولة قانون جمهورية وديمقراطية ويتطلع أن يجعل من الدستور الإطار الأمثل لتعزيز الروابط الوطنية وضمان الحريات الديمقراطية للمواطن.\nإن الدّستـــور يعكـــس عبقريّة الشّعـــب، ومرآته الصّافيـــة الّتي تعبـــر عن تطلّعاتـــه، وإصـــراره، ونِتـــاج التّحوّلات الاجتمــاعيّة والسياسية العميقة الّتي أحدثها. وبموافقته عليه يؤكّد بكلّ عزم أكثر من أيّ وقت مضى سموّ القانون.\nتُعبّر الجزائر عن تمسكها بالعمل للوقاية من الفساد ومكافحته وفقا للاتفاقيات الدولية التي صادقت عليها.\nإنّ الدّستور فوق الجميع، وهو القانون الأساسي الذي يضمن الحقوق والحرّيّات الفرديّة والجماعيّة، ويحمي مبدأ حرّيّة اختيار الشّعب، ويضفي المشروعية على ممارسة السّلطات، ويكرّس التداول الديمقراطي عن طريق انتخابات دورية، حرّة ونزيهة.\nيكفل الدستور الفصل بين السلطات والتوازن بينها واستقلال العدالة والحماية القانونية ورقابة عمل السّلطات العموميّة وضمان الأمن القانوني والديمقراطي.\nيُعبّر الشعب الجزائري عن تمسكه بحقوق الإنسان المنصوص عليها في الإعلان العالمي لحقوق الإنسان لسنة 1948، والاتفاقيات الدولية التي صادقت عليها الجزائر.\nإن الشعب الجزائري متمسك بخياراته من أجل الحد من الفوارق الاجتماعية والقضاء على أوجه التفاوت الجهوي، ويعمل على بناء اقتصاد منتج وتنافسي في إطار التنمية المستدامة.\nكما يظل الشعب منشغلا بتدهور البيئة والنتائج السلبية للتغير المناخي، وحريصا على ضمان حماية الوسط الطبيعي والاستعمال العقلاني للموارد الطبيعية وكذا المحافظة عليها لصالح الأجيال القادمة.\nواعترافا بالطاقة الهائلة التي يشكلها الشباب الجزائري، وبتطلعاته وإصراره على رفع التحديات السياسية والاقتصادية والاجتماعية والثقافية للبلاد، أصبح من الضروري إشراكه الفعلي في عملية البناء والمحافظة على مصالح الأجيال القادمة، بضمان تكوين نوعي له تتولاه مؤسسات الدولة والمجتمع.\nإنّ الجيش الوطني الشعبي سليل جيش التحرير الوطني يتولى مهامه الدستورية بروح الالتزام المثالي والاستعداد البطـــولي عـــلى التضحيـــة كلمـــا تطلـــب الواجـــب الوطني منــه ذلك. ويعتـــز الشعـــب الجزائــري بجيشـــه الوطني الشعبي ويدين له بالعرفان على ما بذله في سبيل الحفاظ على البلاد من كل خطر خارجي وعلى مساهمته الجوهرية في حماية المواطنين والمؤسسات والممتلكات من آفة الإرهاب، وهو ما ساهم في تعزيز اللحمة الوطنية وفي ترسيخ روح التضامن بين الشعب وجيشه.\nتسهر الدولة على احترافية الجيش الوطني الشعبي وعلى عصرنته بالشكل الذي يجعله يمتلك القدرات المطلوبة للحفاظ عــــلى الاستقــــلال الوطنــي، والدفــــاع عـــن السيـــادة الوطنيـــة، ووحـــدة البـــلاد وحرمتهـــا الترابيـــة وحمايـــة مجالهـــا البــري والجــوي والبحري.\nفالشّعب المتحصّن بقيمه الرّوحيّة الرّاسخة، والمحافظ على تقاليده في التّضامن والعدل، واثق في قدرته على المساهمة الفعّالة في التّقدّم الثّقافيّ، والاجتماعيّ، والاقتصاديّ، في عالم اليوم والغد.\nإنّ الجزائر، أرض الإسلام، وجزء لا يتجزّأ من المغرب العربيّ الكبير، وأرض عربيّة وأمازيغية، وبلاد متوسّطيّة وإفريقيّة تعتزّ بإشعاع ثورتها، ثورة أوّل نوفمبر، ويشرّفها الاحترام الّذي أحرزته، وعرفت كيف تحافظ عليه بالتزامها إزاء كلّ القضايا العادلة في العالم.\nإن الجزائر المتمسّكة بالسلم وحقوق الإنسان والتنمية، توجه سياستها الخارجية نحو تعزيز حضورها ونفوذها في محافل الأمم عبر عمليات الشراكة القائمة على المصالح المتبادلة التي تكون منسجمة كل الانسجام مع خياراتها السياسية والاقتصادية والاجتماعية والثقافية الوطنية، وفي ظل احترام أهداف ومبادئ منظمة الأمم المتحدة والاتحاد الإفريقي وجامعة الدول العربية.\nإن فخر الشّعب، وتضحياته، وإحساسه بالمسؤوليّات، وتمسّكه العريق بالحرّيّة، والعدالة الاجتماعيّة، تمثّل كلّها أحسن ضمان لاحترام مبادئ هذا الدّستور الّذي يصادق عليه وينقله إلى الأجيال القادمة ورثة روّاد الحرّيّة، وبناة المجتمع الحرّ.\nتشكل هذه الديباجة جزءا لا يتجزأ من هذا الدستور."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 1,
    "اسم الفصل": "الجزائر",
    "رقم المادة": 1,
    "نص المادة": " \nالجزائر جمهورية ديمقراطية شعبية، وهي وحدة لا تتجزأ."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 1,
    "اسم الفصل": "الجزائر",
    "رقم المادة": 2,
    "نص المادة": "\nالإســلام ديـــن الدّولـــة."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 1,
    "اسم الفصل": "الجزائر",
    "رقم المادة": 3,
    "نص المادة": "\nاللّغة العربيّة هي اللّغة الوطنيّة والرّسميّة.\nتظل العربيّة اللّغة الرسميّة للدّولة.\nيُحدث لدى رئيس الجمهورية مجلس أعلى للّغة العربيّة.\nيكلف المجلس الأعلى للّغة العربيّة على الخصوص بالعمل على ازدهار اللّغة العربيّة وتعميم استعمالها في الميادين العلميّة والتكنولوجيّة والتشجيع على التّرجمة إليها لهذه الغاية."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 1,
    "اسم الفصل": "الجزائر",
    "رقم المادة": 4,
    "نص المادة": "\nتمازيغت هي كذلك لغة وطنيّة ورسميّة.\nتعمل الدّولة لترقيتها وتطويرها بكل تنوّعاتها اللّسانيّة المستعملة عبر التراب الوطني.\nيُحدث مَجمع جزائري للغة تمازيغت يوضع لدى رئيس الجمهورية.\nيستند المجمع إلى أشغال الخبراء، ويكلّف بتوفير الشروط اللاّزمة لترقية تمازيغت قصد تجسيد وضعها كلغة رسميّة فيما بعد.\nتحدّد كيفيّات تطبيق هذه المادّة بموجب قانون عضوي."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 1,
    "اسم الفصل": "الجزائر",
    "رقم المادة": 5,
    "نص المادة": "\nعاصمة الجمهوريّة مدينة الجزائر."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 1,
    "اسم الفصل": "الجزائر",
    "رقم المادة": 6,
    "نص المادة": "\nالعلَــــــم الوطنـــــيّ والنّشيـــــد الوطنيّ من مكاســــب ثـــــورة أول نـــوفمبر 1954 وهما غيــر قابلين للتغيير.\nهذان الرمزان من رموز الثورة، هما رمزان للجمهورية بالصفات الآتية :\nيحدد القانون ختم الدولة."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 2,
    "اسم الفصل": "الشعـب",
    "رقم المادة": 7,
    "نص المادة": "\nالشّعب مصدر كلّ سلطة. السّيادة الوطنيّة ملك للشّعب وحده."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 2,
    "اسم الفصل": "الشعـب",
    "رقم المادة": 8,
    "نص المادة": "\nالسّلطة التّأسيسيّة ملك للشّعب.\nيمارس الشّعب سيادته بواسطة المؤسّسات الدّستوريّة التي يختارها.\nيمارس الشّعب هذه السّيادة أيضا عن طريق الاستفتاء وبواسطة ممثّليه المنتخَبين.\nلرئيس الجمهوريّة أن يلتجئ إلى إرادة الشّعب مباشرة."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 2,
    "اسم الفصل": "الشعـب",
    "رقم المادة": 9,
    "نص المادة": "\nيختار الشّعب لنفسه مؤسّسات، غايتها ما يأتي :\n– المحافظة على السيادة والاستقلال الوطنيين، ودعمهما،\n– المحافظة على الهوّيّة والوحدة الوطنيتين، ودعمهما،\n– حماية الحرّيّات الأساسيّة للمواطن، والازدهار الاجتماعيّ والثّقافيّ للأمّة،\n– ترقية العدالة الاجتماعية،\n– ضمان الشفافية في تسيير الشؤون العمومية،\n– القضاء على التفاوت الجهوي في مجال التنمية،\n– تشجيع بناء اقتصاد متنوع يثمن قدرات البلد كلها، الطبيعية والبشرية والعلمية،\n– حماية الاقتصاد الوطنيّ من أيّ شكل من أشكال التّلاعب، أو الاختلاس، أو الرشوة، أو التجارة غير المشروعة، أو التعسف، أو الاستحواذ، أو المصادرة غير المشروعة أو تهريب رؤوس الأموال."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 2,
    "اسم الفصل": "الشعـب",
    "رقم المادة": 10,
    "نص المادة": "\nتــسهـر الـدولة عـلى تفعيل دور المجـتمع المـــدني للـمـشــاركة في تسيير الشؤون العمومية."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 2,
    "اسم الفصل": "الشعـب",
    "رقم المادة": 11,
    "نص المادة": "\nتمتنع المؤسّسات عن القيام بما يأتي :\nالممارسات الإقطاعيّة، والجهويّة، والمحسوبيّة،\nإقامة علاقات الاستغلال والتّبعيّة،\nالسّلوك المخالف للأخلاق الإسلاميّة وقيم ثورة نوفمبر."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 2,
    "اسم الفصل": "الشعـب",
    "رقم المادة": 12,
    "نص المادة": "\nالشّعب حرّ في اختيار ممثّليه.\nلا حدود لتمثيل الشّعب، إلاّ ما نصّ عليه الدّستور وقانون الانتخابات."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 3,
    "اسم الفصل": "الدولة",
    "رقم المادة": 13,
    "نص المادة": "\nتستمدّ الدّولة وجودها وشرعيتها من إرادة الشّعب.\nشعار الدولة “بالشّعب وللشّعب”.\nالدولة في خدمة الشعب وحده."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 3,
    "اسم الفصل": "الدولة",
    "رقم المادة": 14,
    "نص المادة": "\nتُمارَس سيادة الدّولة على مجالها البرّيّ، ومجالها الجوّيّ، وعلى مياهها.\nكما تُمارِس الدّولة حقّها السّيّد الّذي يقرّه القانون الدّوليّ على كلّ منطقة من مختلف مناطق المجال البحريّ التي ترجع إليها."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 3,
    "اسم الفصل": "الدولة",
    "رقم المادة": 15,
    "نص المادة": "\nلا يجوز البتّة التّنازل أو التّخلّي عن أيّ جزء من التّراب الوطنيّ."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 3,
    "اسم الفصل": "الدولة",
    "رقم المادة": 16,
    "نص المادة": "\nتقوم الدولة على مبـدئ التمثيل الديمقراطي، والفصل بـين السلطات، وضمان الحقوق والحريات والعدالة الاجتماعية.\nالمجلس المنتخَب هو الإطار الّذي يعبّر فيه الشّعب عن إرادته، ويراقب عمل السّلطات العموميّة.\nتشجع الدولة الديمقراطية التشاركية على مستوى الجماعات المحلية، لاسيما من خلال المجتمع المدني."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 3,
    "اسم الفصل": "الدولة",
    "رقم المادة": 17,
    "نص المادة": "\nالجماعات المحلية للدّولة هي البلديّة والولاية.\nالبلديّة هي الجماعة القاعديّة.\nبغرض تحقيق توازن اقتصادي واجتماعي للبلديات محدودة التنمية، وتكفل أفضل باحتياجات سكانها، يمكن أن يخص القانون بعض البلديات، الأقل تنمية، بتدابير خاصة."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 3,
    "اسم الفصل": "الدولة",
    "رقم المادة": 18,
    "نص المادة": "\nتقوم العلاقات بين الدولة والجماعات المحلية على مبادئ اللامـــركزية وعدم التركيز."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 3,
    "اسم الفصل": "الدولة",
    "رقم المادة": 19,
    "نص المادة": "\nيمثّل المجلس المنتخَب قاعدة اللاّمركزيّة، ومكان مشاركة المواطنين في تسيير الشّؤون العموميّة."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 3,
    "اسم الفصل": "الدولة",
    "رقم المادة": 20,
    "نص المادة": "\nالملكيّة العامّة هي ملك المجموعة الوطنيّة.\nوتشمل باطن الأرض، والمناجم، والمقالع، والموارد الطّبيعيّة للطّاقة، والثّروات المعدنيّة الطّبيعيّة والحيّة، في مختلف مناطق الأملاك الوطنيّة البحريّة، والمياه، والغابات.\nكما تشمل النّقل بالسّكك الحديديّة، والنّقل البحريّ والجوّيّ، والبريد والمواصلات السّلكيّة واللاّسلكيّة، وأملاكا أخرى محددة في القانون."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 3,
    "اسم الفصل": "الدولة",
    "رقم المادة": 21,
    "نص المادة": "\nتسهـر الدولـة علـى :\nحماية الأراضي الفلاحية،\nضمان بيئة سليمة من أجل حماية الأشخاص وتحقيق رفاههم،\nضمان توعية متواصلة بالمخاطر البيئية،\nالاستعمال العقلاني للمياه والطاقات الأحفورية والموارد الطبيعية الأخرى،\nحماية البيئة بأبعادها البرية والبحرية والجوية، واتخاذ كل التدابير الملائمة لمعاقبة الملوثين."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 3,
    "اسم الفصل": "الدولة",
    "رقم المادة": 22,
    "نص المادة": "\nيحدد القانون الأملاك الوطنيّة.\nتتكوّن الأملاك الوطنيّة من الأملاك العموميّة والخاصّة الّتي تملكها كلّ من الدّولة والولاية والبلديّة.\nتُسيّر الأملاك الوطنيّة طبقا للقانون."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 3,
    "اسم الفصل": "الدولة",
    "رقم المادة": 23,
    "نص المادة": "\nتنظم الدولة التّجارة الخارجيّة.\nيحدّد القانون شروط ممارسة التّجارة الخارجيّة ومراقبتها."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 3,
    "اسم الفصل": "الدولة",
    "رقم المادة": 24,
    "نص المادة": "\nيحـظــر استحداث أي منصـب عمـومي أو القـيام بــأي طلب عمومي لا يستهدف تحقيق المصلحة العامة.\nلا يمكن أن تكون الوظائف والعُهدات في مؤسّسات الدّولة مصدرا للثراء، ولا وسيلة لخدمة المصالح الخاصّة.\nيجب على كل عون عمومي، في إطار ممارسة مهامه، تفادي أي حالة من حالات تعارض المصالح.\nيجب على كل شخص يُعيّن في وظيفة عليا في الدولة، أو ينتخب أو يُعيّن في البرلمان، أو في هيئة وطنية، أو ينتخب في مجلس محلي، التصريح بممتلكاته في بداية وظيفته أو عهدته وفي نهايتها.\nيحدد القانون كيفيات تطبيق هذه الأحكام."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 3,
    "اسم الفصل": "الدولة",
    "رقم المادة": 25,
    "نص المادة": "\nيعاقب القانون على استغلال النفوذ والتعسف في استعمال السلطة."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 3,
    "اسم الفصل": "الدولة",
    "رقم المادة": 26,
    "نص المادة": "\nالإدارة في خدمة المواطن.\nيضمن القانون عدم تحيّز الإدارة.\nتلزم الإدارة برد معلل في أجل معقول بشأن الطلبات التي تستوجب إصدار قرار إداري.\nتتعامل الإدارة بكل حياد مع الجمهور في إطار احترام الشرعية، وأداء الخدمة بدون تماطل."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 3,
    "اسم الفصل": "الدولة",
    "رقم المادة": 27,
    "نص المادة": "\nتضمن المرافق العمومية لكل مرتفق التساوي في الحصول على الخدمات، وبدون تمييز.\nتقوم المرافق العمومية على مبادئ الاستمرارية، والتكيّف المستمر، والتغطية المنصفة للتراب الوطني، وعند الاقتضاء، ضمان حد أدنى من الخدمة."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 3,
    "اسم الفصل": "الدولة",
    "رقم المادة": 28,
    "نص المادة": "\nالدّولة مسؤولة عن أمن الأشخاص والممتلكات."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 3,
    "اسم الفصل": "الدولة",
    "رقم المادة": 29,
    "نص المادة": "\nتعمل الدولة على حماية حقوق المواطنين في الخارج ومصالحهم، في ظل احترام القانون الدولي والاتفاقيات المبرمة مع بلدان الاستقبال أو بلدان الإقامة.\nتسهر الدولة على الحفاظ على هوية وكرامة المواطنين المقيمين في الخارج وتعزيز روابطهم مع الأمة، وتعبئة مساهماتهم في تنمية بلدهم الأصلي."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 3,
    "اسم الفصل": "الدولة",
    "رقم المادة": 30,
    "نص المادة": "\nتنتظم الطّاقة الدّفاعيّة للأمّة، ودعمها، وتطويرها، حول الجيش الوطني الشّعبي.\nتتمثّل المهمّة الدّائمة للجيش الوطنيّ الشّعبيّ في المحافظة على الاستقلال الوطنيّ، والدّفاع عن السّيادة الوطنيّة.\nكما يضطلع بالدّفاع عن وحدة البلاد، وسلامتها التّرابيّة، وحماية مجالها البرّيّ والجوّيّ والبحري.\nيتولى الجيش الوطني الشعبي الدفاع عن المصالح الحيوية والاستراتيجية للبلاد طبقا لأحكام الدستور."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 3,
    "اسم الفصل": "الدولة",
    "رقم المادة": 31,
    "نص المادة": "\nتمتنع الجزائر عن اللّجوء إلى الحرب من أجل المساس بالسّيادة المشروعة للشّعوب الأخرى وحرّيّتها.\nتبذل الجزائر جهدها لتسوية الخلافات الدّوليّة بالوسائل السّلميّة.\nيمكن للجزائر، في إطار احترام مبادئ وأهداف الأمم المتحدة والاتحاد الإفريقي وجامعة الدول العربية، أن تشارك في حفظ السلم."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 3,
    "اسم الفصل": "الدولة",
    "رقم المادة": 32,
    "نص المادة": "\nالجــزائر متضامنة مع جميع الشّعـوب الّتي تكافح من أجل التّحرّر السّياسيّ والاقتصاديّ، والحقّ في تقرير المصير، وضدّ كلّ تمييز عنصريّ."
  },
  {
    "رقم الباب": 1,
    "اسم الباب": "المبادئ العامة التي تحكم المجتمع الجزائري",
    "رقم الفصل": 3,
    "اسم الفصل": "الدولة",
    "رقم المادة": 33,
    "نص المادة": "\nتعمل الجزائر من أجل دعم التّعاون الدّوليّ، وتنمية العلاقات الودّية بين الدول، على أساس المساواة، والمصلحة المتبادلة، وعدم التّدخّل في الشّؤون الدّاخليّة. وتتبنّى مبادئ ميثاق الأمم المتّحدة وأهدافه."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 34,
    "نص المادة": "\nتُلـزِم الأحكـام الدستـورية ذات الصلة بالحقوق الأساسية والحريات العامة وضماناتها، جميع السلطات والهيئات العمومية.\nلا يمكن تقييد الحقوق والحريات والضمانات إلاّ بموجب قانون، ولأسباب مرتبطة بحفظ النظام العام والأمن، وحماية الثوابت الوطنية وكذا تلك الضرورية لحماية حقوق وحريات أخرى يكرسها الدستور.\nفي كل الأحوال، لا يمكن أن تمس هذه القيود بجوهر الحقوق والحريات.\nتحقيقا للأمن القانوني، تسهر الدولة، عند وضع التشريع المتعلق بالحقوق والحريات، على ضمان الوصول إليه ووضوحه واستقراره."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 35,
    "نص المادة": "المادة 35\nتضمن الدولة الحقوق الأساسية والحريات.\nتستهدف مؤسسات الجمهورية ضمان مساواة كلّ المواطنين والمواطنات في الحقوق والواجبات بإزالة العقبات الّتي تعوق تفتّح شخصيّة الإنسان، وتحول دون المشاركة الفعلية للجميع في الحياة السّياسيّة، والاقتصاديّة، والاجتماعيّة، والثّقافيّة."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 36,
    "نص المادة": "المادة 36\nالجنسيّة الجزائريّة معرّفة بالقانون.\nيحدد القانون شروط اكتساب الجنسيّة الجزائريّة، والاحتفاظ بها، أو فقدانها، أو التجريد منها"
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 37,
    "نص المادة": "المادة 37\nكل المواطنين سواسية أمام القانون، ولهم الحق في حماية متساوية. ولا يمكن أن يُتذرّع بأيّ تمييز يعود سببه إلى المولِد، أو العِرق، أو الجِنس، أو الرّأي، أو أيّ شرط أو ظرف آخر، شخصيّ أو اجتماعيّ."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 38,
    "نص المادة": "المادة 38\nالحق في الحياة لصيق بالإنسان، يحميه القانون، ولا يمكن أن يحرم أحد منه إلاّ في الحالات التي يحددها القانون."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 39,
    "نص المادة": "المادة 39\nتضمن الدولة عدم انتهاك حرمة الإنسان.\nيحظر أي عنف بدني أو معنوي، أو أي مساس بالكرامة.\nيعاقب القانون على التعذيب، وعلى المعاملات القاسية، واللاإنسانية أو المهينة، والاتجار بالبشر."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 40,
    "نص المادة": "المادة 40\nتحمي الدولة المرأة من كل أشكال العنـف في كل الأماكن والظروف، في الفضاء العمومي وفي المجالين المهني والخاص. ويضمن القانون استفادة الضحايا من هياكل الاستقبال ومن أنظمة التكفل، ومن مساعدة قضائية."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 41,
    "نص المادة": "المادة 41\nكل شخص يُعتبر بريئا حتّى تثبِت جهة قضائيّة إدانته، في إطار محاكمة عادلة."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 42,
    "نص المادة": "المادة 42\nللأشخاص المعوزين الحق في المساعدة القضائية.\nيحدد القانون شروط تطبيق هذا الحكم."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 43,
    "نص المادة": "المادة 43\nلا إدانة إلاّ بمقتضى قانون صادر قبل ارتكاب الفعل المجرّم."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 44,
    "نص المادة": "المادة 44\nلا يُتابع أحد، ولا يُوقف أو يُحتجز، إلاّ ضمن الشروط المحدّدة بالقانون، وطبقا للأشكال الّتي نصّ عليها.\nيتعيّن إعلام كل شخص موقوف بأسباب توقيفه.\nالحبس المؤقت إجراء استثنائي، يحدد القانون أسبابه ومدته وشروط تمديده.\nيعاقب القانون على أعمال وأفعال الاعتقال التعسفي."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 45,
    "نص المادة": "المادة 45\nيخضـــع التّوقيف للنّظر في مجال التّحرّيّات الجزائيّة للرّقابة القضائيّة، ولا يمكن أن يتجاوز مدّة ثمان وأربعين (48) ساعة.\nيملك الشّخص الّذي يُوقف للنّظر حقّ الاتّصال فورا بأسرته.\nيجب إعلام الشخص الذي يوقف للنظر بحقه أيضا في الاتصال بمحاميه، ويمكن القاضي أن يحدّ من ممارسة هذا الحق في إطار ظروف استثنائية ينص عليها القانون.\nلا يمكن تمديد مدّة التّوقيف للنّظر، إلاّ استثناء، ووفقا للشّروط المحدّدة بالقانون.\nعند انتهاء مدّة التّوقيف للنّظر، يجب أن يُجرى فحص طبّي على الشّخص الموقوف، إن طلب ذلك، على أن يُعلَم بهذه الإمكانيّة، في كل الحالات.\nيخضع القصّر إجباريا لفحص طبي.\nيحدد القانون كيفيات تطبيق هذه المادة."
  },

  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 46,
    "نص المادة": "المادة 46\nلكل شخص كان محل توقيف أو حبس مؤقت تعسفيين أو خطأ قضائي، الحق في التعويض.\nيحدّد القانون شروط وكيفيّات تطبيق هذا الحكم."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 47,
    "نص المادة": "المادة 47\nلكل شخص الحق في حماية حياته الخاصة وشرفه.\nلكل شخص الحق في سرّية مراسلاته واتصالاته الخاصة في أي شكل كانت.\nلا مساس بالحقوق المذكورة في الفقرتين الأولى والثانية إلاّ بأمر معلل من السلطة القضائية.\nحماية الأشخاص عند معالجة المعطيات ذات الطابع الشخصي حق أساسي.\nيعاقب القانون على كل انتهاك لهذه الحقوق."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 48,
    "نص المادة": "المادة 48\nتضمن الدّولة عدم انتهاك حُرمة المسكن.\nلا تفتيش إلاّ بمقتضى القانون، وفي إطار احترامه.\nلا تفتيش إلاّ بأمر مكتوب صادر عن السّلطة القضائيّة المختصّة."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 49,
    "نص المادة": "المادة 49\nيحِـقّ لكلّ مواطن يتمتّع بحقوقه المدنيّة والسياسيّة، أن يختار بحرّيّة موطن إقامته، وأن يتنقّل بحرية عبر التّراب الوطنيّ.\nلكل مواطن الحقّ في الدّخول إلى التّراب الوطنيّ والخروج منه.\nلا يمكن تقييد هذه الحقوق إلاّ لمدة محددة، وبموجب قرار معلل من السلطة القضائية."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 50,
    "نص المادة": "المادة 50\nيتمتع كل أجنبي يتواجد فوق التراب الوطني بشكل قانوني بحماية القانون لشخصه وأملاكه.\nلا يمكن تسليم أحد إلاّ بمقتضى اتفاقية دولية مصادق عليها، أو بموجب قانون.\nلا يمكن، في أي حال، تسليم أو إبعاد أي لاجئ سياسي استفاد قانونا من حق اللجوء."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 51,
    "نص المادة": "المادة 51\nلا مساس بحُرمة حرية الرّأي.\nحرية ممارسة العبادات مضمونة وتمارس في إطار احترام القانون.\nتضمن الدولة حماية أماكن العبادة من أي تأثير سياسي أو إيديولوجي."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 52,
    "نص المادة": "المادة 52\nحرية التعبير مضمونة.\nحرية الاجتماع وحرية التظاهر السلمي مضمونتان، وتمارسان بمجرد التصريح بهما.\nيحدد القانون شروط وكيفيات ممارستها."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 53,
    "نص المادة": "المادة 53\nحقّ إنشاء الجمعيّات مضمون، ويمارس بمجرد التصريح به.\nتشجع الدولة الجمعيات ذات المنفعة العامة.\nيحدّد قانون عضوي شروط وكيفيات إنشاء الجمعيّات.\nلا تحل الجمعيات إلاّ بمقتضى قرار قضائي."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 54,
    "نص المادة": "المادة 54\nحرية الصحافة، المكتوبة والسمعية البصرية والإلكترونية، مضمونة.\nتتضمن حرية الصحافة على وجه الخصوص ما يأتي :\n– حرية تعبير وإبداع الصحفيين ومتعاوني الصحافة،\n– حق الصحفي في الوصول إلى مصادر المعلومات في إطار احترام القانون،\n– الحق في حماية استقلالية الصحفي والسرّ المهني،\n– الحق في إنشاء الصحف والنشريات بمجرد التصريح بذلك،\n– الحق في إنشاء قنوات تلفزيونية وإذاعية ومواقع وصحف إلكترونية ضمن شروط يحددها القانون،\n– الحق في نشـــر الأخبار والأفكار والصور والآراء في إطار القانون، واحترام ثوابت الأمة وقيمها الدينية والأخلاقية والثقافية.\nلا يمكن أن تستعمل حرية الصحافة للمساس بكرامة الغير وحرياتهم وحقوقهم.\nيحظر نشر خطاب التمييز والكراهية.\nلا يمكن أن تخضع جنحة الصحافة لعقوبة سالبة للحرية.\nلا يمكن توقيف نشاط الصحف والنشريات والقنوات التلفزيونية والإذاعية والمواقع والصحف الإلكترونية إلاّ بمقتضى قرار قضائي."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 55,
    "نص المادة": "المادة 55\nيـتمتع كل مواطن بالحق في الـوصول إلى المــــعـــــلومات والـــــوثــــائــــــق والإحصائيات، والحصول عليها وتداولها.\nلا يمكن أن تمس ممارسة هذا الحق بالحياة الخاصة للغير وبحقوقهم، وبالمصالح المشروعة للمؤسسات، وبمقتضيات الأمن الوطني.\nيحدد القانون كيفيات ممارسة هذا الحق."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 56,
    "نص المادة": "المادة 56\nلكل مواطن تتوفر فيه الشروط القانونية الحق في أن يَنتخب وأن يُنتخب."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 57,
    "نص المادة": "المادة 57\nحقّ إنشاء الأحزاب السّياسيّة معترَف به ومضمون.\nلا يجوز تأسيس الأحزاب السّياسيّة على أساس دينيّ أو لغويّ أو عرقيّ أو جنسيّ أو مهنيّ أو جهويّ.\nلا يمكن التّذرّع بهذا الحقّ لضرب الحرّيّات الأساسيّة، والقيم والمكوّنات الأساسيّة للهوّيّة الوطنيّة، والوحدة الوطنيّة، وأمن التّراب الوطنيّ وسلامته، واستقلال البلاد، وسيادة الشّعب، وكذا الطّابع الدّيمقراطيّ والجمهوريّ للدّولة.\nلا يجوز للأحزاب السّياسيّة اللّجوء إلى الدّعاية الحزبيّة الّتي تقوم على العناصر المبيّنة في الفقرة السّابقة.\nتضمن الدولة معاملة منصفة تجاه كل الأحزاب السياسية.\nيُحظَر على الأحزاب السّياسيّة كلّ شكل من أشكال التّبعيّة للمصالح أو الجهات الأجنبيّة.\nلا يجوز أن يلجأ أيّ حزب سياسيّ إلى استعمال العنف أو الإكراه مهما كانت طبيعتهما أو شكلهما.\nيجب على الإدارة أن تمتنع عن كل ممارسة تحول بطبيعتها دون ممارسة هذا الحق.\nلا تحل الأحزاب السياسية إلاّ بمقتضى قرار قضائي.\nيحدد قانون عضوي كيفيات إنشاء الأحزاب السياسية، ويجب أن لا يتضمن أحكاما من شأنها المساس بحرية إنشائها."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 58,
    "نص المادة": "تستفيد الأحزاب السياسية المعتمدة، ودون أي تمييز، في ظل احترام أحكام المادة 57 أعلاه، على الخصوص، من الحقوق الآتية :\n– حريات الرأي والتعبير والاجتماع والتظاهر السلمي،\n– حيّز زمني في وسائل الإعلام العمومية يتناسب مع تمثيلها على المستوى الوطني،\n– تمويل عمومي، عند الاقتضاء، يحدده القانون حسب تمثيلها،\n– ممارسة السلطة على الصعيدين المحلي والوطني من خلال التداول الديمقراطي، وفي إطار أحكام هذا الدستور.\nيحدد القانون كيفيات تطبيق هذه المادة."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 59,
    "نص المادة": "المادة 59\nتعمل الدولة على ترقية الحقوق السياسية للمرأة بتوسيع حظوظ تمثيلها في المجالس المنتخبة.\nيحدد قانون عضوي شروط تطبيق هذا الحكم."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 60,
    "نص المادة": "المادة 60\nالملكيّة الخاصّة مضمونة.\nلا تنزع الملكية إلاّ في إطار القانون، وبتعويض عادل ومنصف.\nحقّ الإرث مضمون.\nالأملاك الوقفيّة وأملاك الجمعيّات الخيريّة مُعترَف بها، ويحمي القانون تخصيصها."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 61,
    "نص المادة": "المادة 61\nحرية التجارة والاستثمار والمقاولة مضمونة، وتمارس في إطار القانون."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 62,
    "نص المادة": "المادة 62\nتعمل السلطات العمومية على حماية المستهلكين، بشكل يضمن لهم الأمن والسلامة والصحة وحقوقهم الاقتصادية."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 63,
    "نص المادة": "المادة 63\nتسهر الدولة على تمكين المواطن من :\n– الحصول على ماء الشرب، وتعمل على المحافظة عليه للأجيال القادمة،\n– الرعاية الصحية، لاسيما للأشخاص المعوزين والوقاية من الأمراض المعدية والوبائية ومكافحتها،\n– الحصول على سكن، لاسيما للفئات المحرومة."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 64,
    "نص المادة": "المادة 64\nللمواطن الحق في بيئة سليمة في إطار التنمية المستدامة.\nيحدد القانون واجبات الأشخاص الطبيعيين والمعنويين لحماية البيئة."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 65,
    "نص المادة": "المادة 65\nالحقّ في التربـية والتّعليم مضمونـــان، وتسهـر الدولة باستمرار على تحسين جودتهما.\nالتّعليم العمومي مجّاني وفق الشّروط الّتي يحدّدها القانون.\nالتّعليم الابتدائي والمتوسط إجباريّ، وتنظم الدولة المنظومة التعليمية الوطنية.\nتسهر الدولة على ضمان حياد المؤسسات التربوية وعلى الحفاظ على طابعها البيداغوجي والعلمي، قصد حمايتها من أي تأثير سياسي أو إيديولوجي.\nتُعد المدرسة القاعدة الأساسية للتربية على المواطنة.\nتسهر الدّولة على ضمان التّساوي في الالتحاق بالتّعليم والتّكوين المهنيّ.\nتُعد المدرسة القاعدة الأساسية للتربية على المواطنة.\nتسهر الدّولة على ضمان التّساوي في الالتحاق بالتّعليم والتّكوين المهنيّ."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 66,
    "نص المادة": "المادة 66\nالعمل حق وواجب.\nكل عمل يقابله أجر.\nضمن القانون أثناء العمل الحقّ في الحماية، والأمن، والنّظافة.\nالحقّ في الرّاحة مضمون، ويحدّد القانون شروط ممارسته.\nيضمن القانون حق العامل في الضمان الاجتماعي.\nيعاقب القانون على تشغيل الأطفال.\nتعمل الدولة على ترقية التمهين وتضع سياسات للمساعدة على استحداث مناصب الشغل.\nيحدد القانون شروط تسخير المستخدَمين لأغراض المصلحة العامة."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 67,
    "نص المادة": "المادة 67\nيتساوى جميع المواطنين في تقلّد المهام والوظائف في الدّولة، باستثناء المهام والوظائف ذات الصلة بالسيادة والأمن الوطنيين.\nيحدد القانون شروط تطبيق هذا الحكم."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 68,
    "نص المادة": "المادة 68\nتعمل الدولة على ترقية التناصف بين الرجال والنساء في سوق التشغيل.\nتشجع الدولة ترقية المرأة في مناصب المسؤولية في الهيئات والإدارات العمومية وعلى مستوى المؤسسات."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 69,
    "نص المادة": "المادة 69\nالحق النقابي مضمون، ويمارس بكل حرية في إطار القانون.\nيمكن لمتعاملي القطاع الاقتصادي أن ينتظموا ضمن منظمات أرباب العمل في إطار احترام القانون."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 70,
    "نص المادة": "المادة 70\nالحقّ في الإضراب مُعترَف به، ويُمارَس في إطار القانون.\nيمكن أن يمنع القانون ممارسة هذا الحقّ، أو يجعل حدودا لممارسته في ميادين الدّفاع الوطنيّ والأمن، أو في جميع الخدمات أو الأنشطة العموميّة ذات المصلحة الحيويّة للأمة."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 71,
    "نص المادة": "المادة 71\nتحظى الأسرة بحماية الدولة.\nحقوق الطفل محمية من طرف الدولة والأسرة مع مراعاة المصلحة العليا للطفل.\nتحمي وتكفل الدولة الأطفال المتخلى عنهم أو مجهولي النسب.\nتحت طائلة المتابعات الجزائية، يلزم الأولياء بضمان تربية أبنائهم.\nتحت طائلة المتابعات الجزائية، يلزم الأبناء بواجب القيام بالإحسان إلى أوليائهم ومساعدتهم.\nيعاقب القانون كل أشكال العنف ضد الأطفال واستغلالهم والتخلي عنهم.\nتسعى الدولة إلى ضمان المساعدة والحماية للمسنّين."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 72,
    "نص المادة": "المادة 72\nتعمل الدولة على ضمان إدماج الفئات المحرومة ذات الاحتياجات الخاصة في الحياة الاجتماعية.\nيحدد القانون شروط وكيفيات تطبيق هذا الحكم."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 73,
    "نص المادة": "المادة 73\nتسهر الدولة على توفير الوسائل المؤسساتية والمادية الكفيلة بتنمية قدرات الشباب، وتحفيز طاقاتهم الإبداعية.\nتشجع الدولة الشباب على المشاركة في الحياة السياسية.\nتحمي الدولة الشباب من الآفات الاجتماعية.\nيحدد القانون شروط تطبيق هذه المادة."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 74,
    "نص المادة": "المادة 74\nحرية الإبداع الفكري، بما في ذلك أبعاده العلمية والفنية، مضمونة.\nلا يمكن تقييد هذه الحرية إلاّ عند المساس بكرامة الأشخاص أو بالمصالح العليا للأمة أو القيم والثوابت الوطنية.\nيحمي القانون الحقوق المترتبة على الإبداع الفكري.\nفي حالة نقل الحقوق الناجمة عن الإبداع الفكري، يمكن للدولة ممارسة حق الشفعة لحماية المصلحة العامة."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 75,
    "نص المادة": "المادة 75\nالحريات الأكاديمية وحرية البحث العلمي مضمونة.\nتعمل الدولة على ترقية البحث العلمي وتثمينه خدمة للتنمية المستدامة للأمة."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 76,
    "نص المادة": "المادة 76\nالحق في الثقافة مضمون.\nلكل شخص الحق في الثقافة بشكل متساوٍ مع الآخرين.\nتحمي الدولة التراث الثقافي الوطني المادي وغير المادي، وتعمل على الحفاظ عليه."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 1,
    "اسم الفصل": "الحقوق الأساسية والحريات العامة",
    "رقم المادة": 77,
    "نص المادة": "المادة 77\nلكل مواطن الحق في تقديم ملتمسات إلى الإدارة، بشكل فردي أو جماعي، لطرح انشغالات تتعلق بالمصلحة العامة أو بتصرفات ماسة بحقوقه الأساسية.\nيتعيّن على الإدارة المعنية الرد على الملتمسات في أجل معقول."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 2,
    "اسم الفصل": "الواجبات",
    "رقم المادة": 78,
    "نص المادة": "المادة 78\nلا يعذر أحد بجهل القانون.\nلا يُحتج بالقوانين والتنظيمات إلاّ بعد نشرها بالطرق الرسمية.\nيجب على كلّ شخص أن يحترم الدّستور، وأن يمتثل لقوانين الجمهوريّة."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 2,
    "اسم الفصل": "الواجبات",
    "رقم المادة": 79,
    "نص المادة": "المادة 79\nيجـب على كلّ مواطن أن يحمي ويصون استقلال البلاد وسيـادتها وسلامة ترابها الوطنيّ ووحدة شعبها وجميع رموز الدّولة.\nيعاقب القانون بكلّ صرامة على الخيانة والتّجسّس والولاء للعدوّ، وعلى جميع الجرائم المرتكَبة ضدّ أمن الدّولة."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 2,
    "اسم الفصل": "الواجبات",
    "رقم المادة": 80,
    "نص المادة": "المادة 80\nعلى كلّ مواطن أن يؤدّي بإخلاص واجباته تجاه المجموعة الوطنيّة.\nالتزام المواطن إزاء الوطن وإجباريّة المشاركة في الدّفاع عنه، واجبان مقدّسان دائمان.\nتضمن الدّولة احترام رموز الثّورة، وأرواح الشّهداء، وكرامة ذويهم، والمجاهدين.\nتعمل الدولة على ترقية كتابة تاريخ الأمة وتعليمه للأجيال الناشئة."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 2,
    "اسم الفصل": "الواجبات",
    "رقم المادة": 81,
    "نص المادة": "المادة 81\nيمارس كل شخص جميع الحرّيات في إطار احترام الحقوق المعترَف بها للغير في الـدّستور، لاسـيّــما منها احـتـرام الـحـق في الـشّرف، والحياة الخاصّة، وحماية الأسرة والطفولة والشّباب."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 2,
    "اسم الفصل": "الواجبات",
    "رقم المادة": 82,
    "نص المادة": "المادة 82\nلا تُحدَث أيّة ضريبة إلاّ بمقتضى القانون.\nكل المكلفين بالضريبة متساوون أمام الضريبة، ويحدد القانون حالات وشروط الإعفاء الكلي أو الجزئي منها.\nالضريبة من واجبات المواطنة.\nلا تحدث بأثر رجعي، أية ضريبة، أو جباية، أو رسم، أو أي حق كيفما كان نوعه.\nكل فعل يهدف إلى التحايل على مبدأ المساواة بين المكلفين بالضريبة، يعد مساسا بمصالح المجموعة الوطنية.\nيعاقب القانون على التهرب والغش الضريبي."
  },
  {
    "رقم الباب": 2,
    "اسم الباب": "الحقوق الأساسية والحريات العامة والواجبات",
    "رقم الفصل": 2,
    "اسم الفصل": "الواجبات",
    "رقم المادة": 83,
    "نص المادة": "المادة 83\nيجب على كل مواطن أن يحمي الملكية العامة ومصالح المجموعة الوطنية، وأن يحترم ملكية الغير."
  },

  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 1,
    "اسم الفصل": "رئيس الجمهورية",
    "رقم المادة": 84,
    "نص المادة": "المادة 84\nيُجسّد رئيـس الجمهوريّة، رئيـس الدّولة، وحدة الأمّة، ويسهـر في كل الظروف على وحدة التراب الوطني والسيادة الوطنية.\nيحمي الدّستور ويسهر على احترامه.\nيُجسّد الدّولةَ داخل البلاد وخارجها.\nله أن يخاطب الأمّة مباشرة."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 1,
    "اسم الفصل": "رئيس الجمهورية",
    "رقم المادة": 85,
    "نص المادة": "المادة 85\nيُنتخَب رئيس الجمهوريّة عن طريق الاقتراع العام المباشر والسرّي.\nيتمّ الفوز في الانتخاب بالحصول على الأغلبيّة المطلقة من أصوات النّاخبين المعبّر عنها.\nيحدّد قانون عضوي كيفيّات تطبيق أحكام هذه المادة."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 1,
    "اسم الفصل": "رئيس الجمهورية",
    "رقم المادة": 86,
    "نص المادة": "المادة 86\nيمارس رئيس الجمهوريّة السّلطة السّامية في حدود أحكام الدّستور."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 1,
    "اسم الفصل": "رئيس الجمهورية",
    "رقم المادة": 87,
    "نص المادة": "المادة 87\nيشترط في المترشّح لرئاسة الجمهورية أن :\n– يتمتّع بالجنسيّة الجزائريّة الأصليّة فقط، ويثبت الجنسية الجزائرية الأصلية للأب والأم،\n– لا يكون قد تجنّس بجنسية أجنبية،\n– يَدين بالإسلام،\n– يبلغ سن الأربعين (40) كاملة يوم إيداع طلب الترشّح،\n– يتمتّع بكامل حقوقه المدنيّة والسّياسيّة،\n– يُثبِت أن زوجه يتمتع بالجنسية الجزائرية الأصلية فقط،\n– يثبت إقامـ دائمة بالجزائـ دون سواها لمدة عشر (10) سنوات، على الأقل، قبل إيداع الترشح،\n– يُثبِت مشاركته في ثورة أوّل نوفمبر 1954 إذا كان مولودا قبل يوليو 1942،\n– يثبت تأديته الخدمة الوطنية أو المبرر القانوني لعدم تأديتها،\n– يُثبِت عدم تورّط أبويه في أعمال ضدّ ثورة أوّل نوفمبر 1954 إذا كان مولودا بعد يوليو 1942،\n– يقدّم التّصريح العلنيّ بممتلكاته العقاريّة والمنقولة داخل الوطن وخارجه.\nيحدّد قانون عضوي كيفيّات تطبيق أحكام هذه المادة."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 1,
    "اسم الفصل": "رئيس الجمهورية",
    "رقم المادة": 88,
    "نص المادة": "المادة 88\nمدّة العهدة الرّئاسيّة خمس (5) سنوات.\nلا يمكن لأحد ممارسة أكثر من عهدتين متتاليتين أو منفصلتين، وفي حالة انقطاع العهدة الرئاسية بسبب استقالة رئيس الجمهورية الجارية عهدته أو لأيّ سبب كان، تُعد عهدة كاملة."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 1,
    "اسم الفصل": "رئيس الجمهورية",
    "رقم المادة": 89,
    "نص المادة": "المادة 89\nيؤدّي رئيس الجمهوريّة اليمين أمام الشّعب بحضور جميع الهيئات العليا في الأمّة خلال الأسبوع الموالي لانتخابه.\nويباشر مهمّته فور أدائه اليمين."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 1,
    "اسم الفصل": "رئيس الجمهورية",
    "رقم المادة": 90,
    "نص المادة": "المادة 90\nيؤدّي رئيس الجمهوريّة اليمين حسب النّصّ الآتي :\n“بسم الله الرّحمن الرّحيم،\nوفاء للتّضحيات الكبرى، ولأرواح شهدائنا الأبرار، وقيم ثورة نوفمبر الخالدة، أُقسم بالله العليّ العظيم، أن أحترم الدّين الإسلاميّ وأمجّده، وأدافع عن الدّستور، وأسهر على استمراريّة الدّولة، وأعمل على توفير الشّروط اللاّزمة للسّير العاديّ للمؤسّسات والنّظام الدّستوريّ، وأسعى من أجل تدعيــم المسـار الدّيمقــراطيّ، وأحتـــرم حــرّيّة اختيـار الشّعـب، ومؤسّسـات الجمهـوريّة وقوانينهـا، وأحافـظ علـى الممتلكـات والمـال العـام، وأحافظ علـى سلامـة ووحـدة التّراب الوطنيّ، ووحدة الشّعب والأمّة، وأحمي الحرّيّات والحقوق الأساسيّة للإنسان والمواطن، وأعمل بدون هوادة من أجل تطوّر الشّعب وازدهاره، وأسعى بكلّ قواي في سبيل تــحقيق المثُل العليا للعدالة والحرّيّة والسّــلم في العالم.\nوالله على ما أقول شهيد“."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 1,
    "اسم الفصل": "رئيس الجمهورية",
    "رقم المادة": 91,
    "نص المادة": "المادة 91\nيضطلع رئيـس الجمهـوريّة، بالإضافة إلى السّلطات الّتي تخـوّلها إيّاه صراحة أحكام أخرى في الدّستور، بالسّلطات والصّلاحيّات الآتية:\n1) هو القائد الأعلى للقوّات المسلّحة للجمهوريّة، ويتولّى مسؤوليّة الدّفاع الوطنيّ،\n2) يقرر إرسال وحدات من الجيش الوطني الشعبي إلى خارج الوطن بعد مصادقة البرلمان بأغلبية ثلثي (3/2) أعضاء كل غرفة من غرفتي البرلمان،\n3) يقرّر السّياسة الخارجيّة للأمّة ويوجّهها،\n4) يرأس مجلس الوزراء،\n5) يعيّن الوزير الأول أو رئيس الحكومة، حسب الحالة، وينهي مهامه،\n6) يتولى السلطة التنظيمية،\n7) يوقّع المراسيم الرّئاسيّة،\n8) له حقّ إصدار العفو وحقّ تخفيض العقوبات أو استبدالها،\n9) يمكنه أن يستشير الشّعب في كلّ قضيّة ذات أهمّيّة وطنيّة عن طريق الاستفتاء،\n10) يستدعي الهيئة الناخبة،\n11) يمكن أن يقرر إجراء انتخابات رئاسية مسبقة،\n12) يبرم المعاهدات الدّوليّة ويصادق عليها،\n13) يسلّم أوسمة الدّولة ونياشينها وشهاداتها التّشريفيّة."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 1,
    "اسم الفصل": "رئيس الجمهورية",
    "رقم المادة": 92,
    "نص المادة": "المادة 92\nيعيّن رئيس الجمهوريّة، لاسيما في الوظائف والمهام الآتية:\n1) الوظائف والمهامّ المنصوص عليها في الدّستور،\n2) الوظائف المدنيّة والعسكريّة في الدّولة،\n3) التّعيينات الّتي تتمّ في مجلس الوزراء باقتراح من الوزير الأول أو رئيس الحكومة، حسب الحالة،\n4) الرئيس الأول للمحكمة العليا،\n5) رئيس مجلس الدّولة،\n6) الأمين العام للحكومة،\n7) محافظ بنك الجزائر،\n8) القضاة،\n9) مسؤولي أجهزة الأمن،\n10) الولاة،\n11) الأعضاء المسيّرين لسلطات الضبط.\nويعيّن رئيس الجمهوريّة سفراء الجمهوريّة والمبعوثين فوق العادة إلى الخارج، وينهي مهامهم.\nويتسلمّ أوراق اعتماد الممثّلين الدّبلوماسيّين الأجانب وأوراق إنهاء مهامهم.\nبالإضافة إلى الوظائف المنصوص عليها في الحالتين 4 و5 أعلاه، يحدد قانون عضوي الوظائف القضائية الأخرى التي يعيّن فيها رئيس الجمهورية."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 1,
    "اسم الفصل": "رئيس الجمهورية",
    "رقم المادة": 93,
    "نص المادة": "المادة 93\nيمكن لرئيـس الجمهورية أن يفوض للوزيـر الأول أو رئيـس الحكومــة، حسب الحالة، بعضاً من صلاحياته.\nلا يجوز، بأيّ حال من الأحوال، أن يفوّض رئيس الجمهوريّة سلطته في تعيين الوزير الأول أو رئيس الحكومة وأعضاء الحكومة وكذا رؤساء المؤسّسات الدّستوريّة وأعضائها الّذين لم ينصّ الدّستور على طريقة أخرى لتعيينهم.\nلا يجوز أن يفوّض سلطته في اللّجوء إلى الاستفتاء وحلّ المجلس الشّعبيّ الوطنيّ، وتقرير إجراء الانتخابات التّشريعيّة قبل أوانها، وتطبيق الأحكام المنصوص عليها في الموادّ 91 و92 ومن 97 إلى 100 و102 و142 و 148 و 149 و 150 من الدّستور."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 1,
    "اسم الفصل": "رئيس الجمهورية",
    "رقم المادة": 94,
    "نص المادة": "المادة 94\nإذا استحال على رئيـس الجمهوريّة أن يمارس مهامه بسبب مـرض خطيـر ومزمن، تجتمـع المحكمة الدستـورية بقوة القانون وبدون أجل، وبعد أن تتثبّت من حقيقــة هذا المانع بكلّ الوسائل الملائمة، تقترح بأغلبية ثلاثة أرباع (4/3) أعضائها على البرلمان التّصريح بثبوت المانع.\nيُعلِن البرلمان، المنعقد بغرفتيه المجتمعتين معا، ثبوت المانع لرئيس الجمهوريّة بأغلبيّة ثلثي (3/2) أعضائه، ويكلف بتولي رئاسة الدولة بالنيابة مدة أقصاها خمسة وأربعون (45) يوما، رئيس مجلس الأمة الذي يمارس صلاحياته مع مراعاة أحكام المادة 96 من الدستور.\nفي حالة استمرار المانع بعد انقضاء خمسة وأربعين (45) يوما، يُعلَن الشّغور بالاستقالة وجوبا حسب الإجراء المنصوص عليه في الفقرتين السّابقتين وطبقا لأحكام الفقرات الآتية من هذه المادّة.\nفي حالة استقالة رئيس الجمهوريّة أو وفاته، تجتمع المحكمة الدستورية وجوبا وتثبت الشّغور النّهائيّ لرئاسة الجمهوريّة، وتُبلّغ فورا شهادة التّصريح بالشّغور النّهائيّ إلى البرلمان الّذي يجتمع وجوبا.\nيتولّى رئيس مجلس الأمة مهام رئيس الدولة لمدة أقصاها تسعون (90) يوما تنظّم خلالها انتخابات رئاسيّة. وفي حالة استحالة إجرائها، يمكن تمديد هذا الأجل لمدة لا تتجاوز تسعين (90) يوما، بعد أخذ رأي المحكمة الدستورية.\nلا يحق لرئيس الدولة المعيّن بهذه الطريقة أن يترشح لرئاسة الجمهورية.\nإذا اقترنت استقالة رئيس الجمهوريّة أو وفاته بشغور رئاسة مجلس الأمة، لأيّ سبب كان، تجتمع المحكمة الدستورية وجوبا، وتثبت بأغلبية ثلاثة أرباع (4/3) أعضائها الشّغور النّهائيّ لرئاسة الجمهوريّة وحصول المانع لرئيس مجلس الأمة. وفي هذه الحالة، يتولّى رئيس المحكمة الدستورية مهام رئيس الدّولة. ويضطلع رئيس الدولة المعيّن حسب الشروط المبينة أعلاه بمهمة رئيس الدولة طبقا للشروط المحدّدة في الفقـرات السّابقة وفي المادّة 96 مـن الدّستور. ولا يمكنه أن يترشح لرئاسة الجمهورية."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 1,
    "اسم الفصل": "رئيس الجمهورية",
    "رقم المادة": 95,
    "نص المادة": "المادة 95\nعندما ينال ترشيح للانتخابات الرئاسية موافقة المحكمة الدستورية، لا يمكن سحبه إلاّ في حالة حصول مانع خطير تثبته المحكمة الدستورية قانونا أو في حالة وفاة المترشح المعني.\nعند انسحاب أحد المترشحين من الدور الثاني، تستمر العملية الانتخابية دون أخذ هذا الانسحاب في الحسبان.\nفي حالة وفاة أحد المترشحين للدور الثاني أو تعرّضه لمانع قانوني، تعلن المحكمة الدستورية وجوب إجراء كل العمليات الانتخابية من جديد، وتمدّد في هذه الحالة آجال تنظيم انتخابات جديدة لمدة أقصاها ستون (60) يوما.\nعند تطبيق أحكام هذه المادة، يظل رئيس الجمهورية السارية عهدته أو من يتولى وظيفة رئيس الدولة، في منصبه حتى أداء رئيس الجمهورية اليمين.\nيحدد قانون عضوي شروط وكيفيات تطبيق أحكام هذه المادة."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 1,
    "اسم الفصل": "رئيس الجمهورية",
    "رقم المادة": 96,
    "نص المادة": "المادة 96\nلا يمكن أن تُقال أو تعــدّل الحكومـة القائمة إبّان حصول المانع لرئيس الجمهوريّة، أو وفاته، أو استقالته، حتّى يَشرَع رئيس الجمهوريّة الجديد في ممارسة مهامه.\nيستقيل الوزير الأول أو رئيس الحكومة، حسب الحالة، وجوبا إذا ترشّح لرئاسة الجمهوريّة. ويمارس وظيفة الوزير الأول أو رئيس الحكومة، حسب الحالة، حينئذ، أحد أعضاء الحكومة الّذي يعيّنه رئيس الدّولة.\nلا يمكن في الفترتين المنصوص عليهما في المادتين 94 و95 أعلاه، تطبيق الأحكام المنصوص عليها في الحالتين 8 و 9 من المادّة 91 والمواد 104 و 142 و 151 و 162 و 219 و 221 و 222 من الدّستور.\nلا يمكن، خلال هاتيـــن الفــترتين، تطــبيق أحكام الموادّ 97 و 98 و 99 و 100 و 102 من الدستور إلاّ بموافقة البرلمان المنعقد بغرفتيه المجتمعتين معاً، بعد استشارة المحكمة الدستورية والمجلس الأعلى للأمن."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 2,
    "اسم الفصل": "الحالات الاستثنائية",
    "رقم المادة": 97,
    "نص المادة": "المادة 97\nيقـرّر رئيس الجمهوريّة، إذا دعـت الضّرورة الملحّة، حالة الطّوارئ أو الحصار، لمدّة أقصاها ثلاثون (30) يوما بعد اجتماع المجلس الأعلى للأمن، واستشارة رئيس مجلس الأمة، ورئيس المجلس الشعبي الوطني، والوزير الأول أو رئيس الحكومة، حسب الحالة، ورئيس المحكمة الدستورية، ويتّخذ كلّ التّدابير اللاّزمة لاستتباب الوضع.\nلا يمكن تمديد حالة الطّوارئ أو الحصار، إلاّ بعد موافقة البرلمان المنعقد بغرفتيه المجتمعتين معا.\nيحدّد قانون عضويّ تنظيم حالة الطّوارئ وحالة الحصار."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 2,
    "اسم الفصل": "الحالات الاستثنائية",
    "رقم المادة": 98,
    "نص المادة": "المادة 98\nيقرّر رئيس الجمهوريّة الحالة الاستثنائيّة إذا كانت البلاد مهدّدة بخطر داهم يوشك أن يصيب مؤسّساتها الدّستوريّة أو استقلالها أو سلامة ترابها لمدة أقصاها ستون (60) يوما.\nلا يتّخذ مثل هذا الإجراء إلاّ بعد استشارة رئيس مجلس الأمة، ورئيس المجلس الشعبي الوطني، ورئيس المحكمة الدستورية، والاستماع إلى المجلس الأعلى للأمن ومجلس الوزراء. وتخوّل الحالة الاستثنائيّة رئيس الجمهوريّة اتخاذ الإجراءات الاستثنائيّة الّتي تستوجبها المحافظة على استقلال الأمّة والمؤسّسات الدستورية في الجمهورية.\nيوجه رئيس الجمهورية في هذا الشأن خطابا للأمة.\nيجتمع البرلمان وجوبا.\nلا يمكن تمديد مدة الحالة الاستثنائية إلاّ بعد موافقة أغلبية أعضاء غرفتي البرلمان المجتمعتين معا.\nتنتهي الحالة الاستثنائيّة، حسب الأشكال والإجراءات السّالفة الذّكر الّتي أوجبَت إعلانها.\nيعرض رئيس الجمهورية، بعد انقضاء مدة الحالة الاستثنائية، القرارات التي اتخذها أثناءها على المحكمة الدستورية لإبداء الرأي بشأنها."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 2,
    "اسم الفصل": "الحالات الاستثنائية",
    "رقم المادة": 99,
    "نص المادة": "المادة 99\nيقرّر رئيس الجمهوريّة التّعبئة العـامّة في مجلس الوزراء بعد الاستماع إلى المجلس الأعلى للأمن واستشارة رئيس مجلس الأمة ورئيس المجلس الشعبي الوطني."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 2,
    "اسم الفصل": "الحالات الاستثنائية",
    "رقم المادة": 100,
    "نص المادة": "المادة 100\nإذا وقـع عُدوان فعليّ على البلاد أو يوشك أن يقع حسبما نصت عليه التّرتيبات الملائمة لميثاق الأمم المتّحدة، يُعلِن رئيس الجمهوريّة الحرب، بعد اجتماع مجلس الوزراء والاستماع إلى المجلس الأعلى للأمن واستشارة رئيس مجلس الأمة ورئيس المجلس الشّعبيّ الوطنيّ ورئيس المحكمة الدستورية.\nيجتمع البرلمان وجوبا.\nيوجّه رئيس الجمهوريّة خطابا للأمّة يُعلِمُها بذلك."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 2,
    "اسم الفصل": "الحالات الاستثنائية",
    "رقم المادة": 101,
    "نص المادة": "المادة 101\nيُوقَف العمل بالدّستور مدّة حالة الحرب، ويتولّى رئيس الجمهوريّة جميع السّلطات.\nإذا انتهت المدّة الرّئاسيّة لرئيس الجمهوريّة، فإنها تمدّد وجوبا إلى غاية نهاية الحرب.\nفي حالة استقالة رئيس الجمهوريّة أو وفاته أو عجزه البدني المثبت قانونا، يتولى رئيس مجلس الأمة باعتباره رئيسا للدّولة، كلّ الصّلاحيّات الّتي تستوجبها حالة الحرب حسب الشّروط نفسها الّتي تسري على رئيس الجمهوريّة.\nفي حالة اقتران شغور منصب رئيس الجمهوريّة ورئاسة مجلس الأمة، يتولّى رئيس المحكمة الدستورية وظائف رئيس الدّولة حسب الشّروط المبيّنة أعلاه."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 2,
    "اسم الفصل": "الحالات الاستثنائية",
    "رقم المادة": 102,
    "نص المادة": "المادة 102\nيوقّع رئيس الجمهوريّة اتّفاقيّات الهدنة ومعاهدات السّلم.\nيلتمس رئيس الجمهورية رأي المحكمة الدستورية بشأن الاتّفاقيّات المتعلّقة بهما.\nيعرض رئيس الجمهورية تلك الاتفاقيات فورا على كلّ غرفة من البرلمان لتوافق عليها صراحة."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 3,
    "اسم الفصل": "الحكومة",
    "رقم المادة": 103,
    "نص المادة": "المادة 103\nيقود الحكومة وزير أول في حال أسفرت الانتخابات التشريعية عــن أغلبية رئاسية.\nيقود الحكومة رئيس حكومة، في حال أسفرت الانتخابات التشريعية عن أغلبية برلمانية.\nتتكون الحكومة من الوزير الأول أو رئيس الحكومة، حسب الحالة، ومن الوزراء الذين يشكلونها."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 3,
    "اسم الفصل": "الحكومة",
    "رقم المادة": 104,
    "نص المادة": "المادة 104\nيعـيّن رئيـــس الجمهوريـــة أعضاء الحكومـة بناء على اقتراح من الوزير الأول أو رئيس الحكومة، حسب الحالة."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 3,
    "اسم الفصل": "الحكومة",
    "رقم المادة": 105,
    "نص المادة": "المادة 105\nإذا أسفرت الانتخابات التشريعية عن أغلبية رئاسية، يعيّن رئيس الجمهورية وزيرا أول ويكلفه باقتراح تشكيل الحكومة وإعداد مخطط عمل لتطبيق البرنامج الرئاسي الذي يعرضه على مجلس الوزراء."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 3,
    "اسم الفصل": "الحكومة",
    "رقم المادة": 106,
    "نص المادة": "المادة 106\nيقدم الوزير الأول مخطط عمل الحكومة إلى المجلس الشّعـبيّ الوطنيّ للموافقة عليه. ويُجري المجلس الشّعبيّ الوطنيّ لهذا الغرض مناقشة عامّة.\nيمكن الوزير الأول أن يكيّف مخطط عمل الحكومة على ضوء مناقشة المجلس الشعبي الوطني بالتشاور مع رئيس الجمهورية.\nيقدّم الوزير الأول عرضا حول مخطط عمل الحكومة لمجلس الأمّة مثلما وافق عليه المجلس الشعبي الوطني.\nيمكن لمجلس الأمّة، في هذا الإطار، أن يصدر لائحة."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 3,
    "اسم الفصل": "الحكومة",
    "رقم المادة": 107,
    "نص المادة": "المادة 107\nيقدّم الوزيـر الأول استقالة الحكومة لرئيس الجمهوريّة في حالة عدم موافقـــة المجلس الشّعبيّ الوطنيّ على مخطط عمل الحكومة.\nيعيّن رئيس الجمهوريّة من جديد وزيرا أول حسب الكيفيّات نفسها."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 3,
    "اسم الفصل": "الحكومة",
    "رقم المادة": 108,
    "نص المادة": "المادة 108\nإذا لم تحصُل موافقة المجلس الشّعبيّ الوطنيّ من جديد، يُحلّ وجوبا.\nتستمرّ الحكومة القائمة في تسيير الشّؤون العاديّة إلى غاية انتخاب المجلس الشّعبيّ الوطنيّ وذلك في أجل أقصاه ثلاثة (3) أشهر."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 3,
    "اسم الفصل": "الحكومة",
    "رقم المادة": 109,
    "نص المادة": "المادة 109\nينفّذ الوزير الأول وينســـــق مخطط العمل الّذي صادق عليـــه المجلس الشّعبيّ الوطنيّ."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 3,
    "اسم الفصل": "الحكومة",
    "رقم المادة": 110,
    "نص المادة": "المادة 110\nإذا أسفرت الانتخابات التشريعية عن أغلبية برلمانية غير الأغلبية الرئاسية، يعيّن رئيـــس الجمهوريــــة رئيــــس الحكومـــــة من الأغلبيــــة البرلمانيـــة، ويكلفـــه بتشكيـــل حكومتـــه وإعداد برنامج الأغلبية البرلمانية.\nإذا لم يصل رئيس الحكومة، المعيّن إلى تشكيل حكومته في أجل ثلاثين (30) يوما، يعيّن رئيس الجمهورية رئيس حكومة جديدََا ويكلفه بتشكيل الحكومة.\nيعرض رئيس الحكومة، في كل الحالات، برنامج حكومته على مجلس الوزراء، ثم يقدمه للبرلمان حسب الشروط المنصوص عليها في المواد 106 (الفقرات الأولى و3 و 4) و 107 و 108."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 3,
    "اسم الفصل": "الحكومة",
    "رقم المادة": 111,
    "نص المادة": "المادة 111\nيجب على الوزير الأول أو رئيس الحكومة، حسب الحالة، أن يقدم سنويا إلى المجلس الشّعبيّ الوطنيّ بيانا عن السّياسة العامّة.\nتعقُب بيان السّياسة العامّة مناقشة عمل الحكومة.\nيمكن أن تُختتَم هذه المناقشة بلائحة.\nكما يمكن أن يترتّب على هذه المناقشة إيداع مُلتمَس رقابة يقوم به المجلس الشّعبيّ الوطنيّ طبقا لأحكام المادتين 161و 162 أدناه.\nللوزير الأول أو رئيس الحكومة، حسب الحالة، أن يطلب من المجلس الشّعبيّ الوطنيّ تصويتا بالثّقة.\nوفي حالة عدم الموافقة على لائحة الثّقة، يقدّم الوزير الأول أو رئيس الحكومة، حسب الحالة، استقالة الحكومة.\nوفي هذه الحالة، يمكن رئيس الجمهوريّة أن يلجأ، قبل قبول الاستقالة، إلى أحكام المادّة 151 أدناه.\nيمكن للوزير الأول أو رئيس الحكومة، حسب الحالة، أن يقدّم إلى مجلس الأمّة بيانا عن السّياسة العامّة."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 3,
    "اسم الفصل": "الحكومة",
    "رقم المادة": 112,
    "نص المادة": "المادة 112\nيمارس الوزير الأول أو رئيس الحكومة، حسب الحالة، زيادة على السّلطات الّتي تخوّلها إيّاه صراحة أحكام أخرى في الدّستور، الصّلاحيّات الآتية :\n1) يوجه وينسق ويراقب عمل الحكومة،\n2) يوزّع الصّلاحيّات بين أعضاء الحكومة مع احترام الأحكام الدّستوريّة،\n3) يقوم بتطبيق القوانين والتنظيمات،\n4) يرأس اجتماعات الحكومة،\n5) يوقّع المراسيم التّنفيذيّة،\n6) يعيّن في الوظائف المدنية للدولة التي لا تندرج ضمن سلطة التعيين لرئيس الجمهورية أو تلك التي يفوضها له هذا الأخير،\n7) يسهر على حسن سير الإدارة العموميّة والمرافق العمومية."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 3,
    "اسم الفصل": "الحكومة",
    "رقم المادة": 113,
    "نص المادة": "المادة 113\nيمكن الوزير الأول أو رئيـس الحكومة، حسب الحالة، أن يقدّم استقالة الحكومة لرئيس الجمهوريّة."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 114,
    "نص المادة": "المادة 114\nيمارس السّلطة التّشريعيّة برلمان يتكوّن مــن غرفتين، وهمــا المجلس الشّعبيّ الوطنيّ ومجلس الأمّة.\nكل غرفة من غرفتي البرلمان لها السيادة في إعداد القانون والتّصويت عليه."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 115,
    "نص المادة": "المادة 115\nيراقــــب البرلمــان عمـــل الحكومــة وفقا للشـّـروط المـحــــدّدة في المــــوادّ 106 و 111 و 158 و 160 من الدّستور.\nيمارس المجلس الشّعبيّ الوطنيّ الرّقابة المنصوص عليها في المادتين 161 و 162 من الدّستور."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 116,
    "نص المادة": "المادة 116\nتتمتع المعارضــة البرلمانية بحقوق تُمكّنها مـــن المشـــاركـــة الفعليــة في الأشغــــال البرلمانيــة وفي الحيـــاة السياسية، لا سيما منها :\n1) حرية الرأي والتعبير والاجتماع،\n2) الاستفادة من الإعانات المالية بحسب نسبة التمثيل في البرلمان،\n3) المشاركة الفعلية في الأعمال التشريعية ومراقبة نشاط الحكومة،\n4) تمثيـل يضمـن لهـا المشاركة الفعلية في أجهـزة غرفتي البرلمان، لاسيما رئاسة اللجان بالتداول،\n5) إخطار المحكمة الدستورية، طبقا لأحكام الفقرة 2 من المادة 193 من الدستور،\n6) المشاركة في الدبلوماسية البرلمانية.\nتخصص كل غرفة من غرفتي البرلمان جلسة شهرية لمناقشة جدول أعمال تقدمه مجموعة أو مجموعات برلمانية من المعارضة.\nيحدد النظام الداخلي لكل غرفة من غرفتي البرلمان كيفيات تطبيق هذه المادة."
  },

  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 117,
    "نص المادة": "المادة 117\nيبقى البرلمان في إطار اختصاصاته الدستورية، وفيّا لثقة الشعب وتطلعاته."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 118,
    "نص المادة": "المادة 118\nيتفرّغ النائب أو عضو مجلس الأمة كليا لممارسة عهدته.\nينص النظام الداخلي لكل من المجلس الشعبي الوطني ومجلس الأمة على أحكام تتعلق بوجوب المشاركة الفعلية لأعضائهما في أشغال اللّجان وفي الجلسات العامة، تحت طائلة العقوبات المطبقة في حالة الغياب.\nتصوّت كل غرفة من غرفتي البرلمان على القوانين واللوائح بحضور أغلبية أعضائها."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 119,
    "نص المادة": "المادة 119\nيمكـن للحكومـة أن تطلـب من البرلمان المصادقة على مشاريع القوانين حسب إجراء الاستعجال.\nيحدد قانون عضوي شروط وكيفيات تطبيق هذا الحكم."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 120,
    "نص المادة": "المادة 120\nيجــرّد المنتخـب في المجلـس الشعبـي الوطـنـي أو في مجلـس الأمـة، المنتمي إلى حزب سياسي، الذي يغيّر طوعا الانتماء الذي انتخب على أساسه، من عهدته الانتخابية بقوة القانون.\nتعلن المحكمة الدستورية شغور المقعد بعد إخطارها وجوبا من رئيس الغرفة المعنية. ويحدد قانون عضوي كيفيات استخلافه.\nيحتفظ النائب الذي استقال من حزبه أو أُبعد منه بعهدته بصفة نائب غير مُنتم."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 121,
    "نص المادة": "المادة 121\nيُنتخَب أعضـاء المجلـس الشّعبـيّ الوطنـيّ عـن طريـق الاقتـراع العام المباشر والسّري.\nيُنتخَب ثلثا (3/2) أعضاء مجلس الأمّة عن طريق الاقتراع غير المباشر والسرّي، بمقعدين عن كل ولاية، من بين أعضاء المجالس الشعبية البلدية وأعضاء المجالس الشعبية الولائية.\nيعيّن رئيس الجمهوريّـة الـثـّلث (3/1) الآخـر من أعـضاء مـجـلس الأمّـة مـن بـيـن الـشّـخــصـيّات والكفاءات الوطنيّة في المجالات العلمية والمهنية والاقتصادية والاجتماعية."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 122,
    "نص المادة": "المادة 122\nيُنتخَب المجلس الشّعبيّ الوطنيّ لعهدة مدتها خمس (5) سنوات.\nتحدّد عهدة مجلس الأمّة بمدّة ستّ (6) سنوات.\nتجدّد تشكيلة مجلس الأمّة بالنّصف كلّ ثلاث (3) سنوات.\nلا يمكن تمديد عهدة البرلمان إلاّ في ظروف خطيرة جدّا لا تسمح بإجراء انتخابات عاديّة.\nويُثبِت البرلمان المنعقد بغرفتيه المجتمعتين معا هذه الحالة بقرار، بناء على اقتراح رئيس الجمهوريّة واستشارة المحكمة الدستورية.\nلا يمكن لأحد ممارسة أكثر من عهدتين برلمانيتين منفصلتين أو متتاليتين."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 123,
    "نص المادة": "المادة 123\nتحـدّد كيفـيّات انتخـاب النّوّاب وكيفــيّات انتخـاب أعضـاء مجلـس الأمّة أو تعيينهـم، وشـروط قابليّتهـم للانتخـاب، ونظـام عـدم قابليّتهم للانتخاب، وحالات التّنافي، ونظام التعويضات البرلمانية، بموجب قانون عضويّ."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 124,
    "نص المادة": "المادة 124\nإثبات عضويّة النّوّاب وأعضاء مجلس الأمّة من اختصاص كلّ غرفة على حـدة."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 125,
    "نص المادة": "المادة 125\nعهدة النّائب وعضـو مجلـس الأمّة وطنيّة، ولا يمكن الجمع بينها وبين عهدات أو وظائف أخرى."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 126,
    "نص المادة": "المادة 126\nكــل نائـب أو عضو مجلـس الأمّة لا يستـوفي شـروط قابليّة انتخابـه أو يفقدهـا، يتعـرّض لسقوط عهدتـه البرلمانيّة.\nيقرّر المجلس الشّعبيّ الوطنيّ أو مجلس الأمّة، حسب الحالة، هذا السّقوط بأغلبيّة أعضائه."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 127,
    "نص المادة": "المادة 127\nالنّائـب أو عضـو مجلس الأمّة مسؤول أمام زملائه الّذيـن يمكنهـم تجريـده من عهدتـه إن اقتـرف فعلا يُخلّ بشرفها.\nيحدّد النّظام الدّاخلي لكلّ واحدة من الغرفتين، الشّروط الّتي يتعرّض فيها أيّ نائب أو عضو مجلس الأمّة للإقصاء، ويقرّر هذا الإقصاء، حسب الحالة، المجلس الشّعبيّ الوطنيّ أو مجلس الأمّة بأغلبيّة أعضائه، دون المساس بجميع المتابعات الأخرى الواردة في القانون."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 128,
    "نص المادة": "المادة 128\nيحـدّد قانون عضويّ الشـروط الّتي يقبـل فيها البرلمان استقالة أحد أعضائه."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 129,
    "نص المادة": "المادة 129\nيتمتـع عضـو البرلمان بالحصانـة بالنسبة للأعمال المرتبطة بممارسة مهامه كما هي محددة في الدستور."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 130,
    "نص المادة": "المادة 130\nيمكن أن يكون عضو البرلمان محل متابعة قضائية عن الأعمال غير المرتبطة بمهامه البرلمانية بعد تنازل صريح من المعني عن حصانته.\nوفي حال عدم التنازل عن الحصانة، يمكن جهات الإخطار إخطار المحكمة الدستورية لاستصدار قرار بشأن رفع الحصانة من عدمها."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 131,
    "نص المادة": "المادة 131\nفي حالة تلبّس أحـد النّوّاب أو أحد أعضـاء مجلـس الأمّة بجنحة أو جناية، يمكن توقيفه، ويخطر بذلك مكتب المجلس الشّعبيّ الوطنيّ، أو مكتب مجلس الأمّة، حسب الحالة، فورا.\nيمكن المكتب المخطَر أن يطلب إيقاف المتابعة وإطلاق سراح النّائب أو عضو مجلس الأمّة، على أن يعمل فيما بعد بأحكام المادّة 130 أعلاه."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 132,
    "نص المادة": "المادة 132\nيحـدّد قانـون عضـويّ شروط استخلاف النّائب أو عضـو مجلـس الأمّة في حالة شغور مقعده."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 133,
    "نص المادة": "المادة 133\nتبتدئ الفترة التّشريعيّة، وجوبا، في اليوم الخامس عشر (15) الذي يلي تاريخ إعلان المحكمة الدستورية النتائج، تحت رئاسة أكبر النّوّاب سنّا، وبمساعدة أصغر نائبين منهم.\nيَنتخِب المجلس الشّعبيّ الوطنيّ مكتبه ويشكّل لجانه.\nتطبّق الأحكام السّابقة الذّكر على مجلس الأمّة."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 134,
    "نص المادة": "المادة 134\nيُنتخَب رئيس المجلس الشّعبيّ الوطنيّ للفترة التّشريعيّة.\nيُنتخَب رئيس مجلس الأمّة بعد كلّ تجديد جزئيّ لتشكيلة المجلس، ويتعيّن أن تتوفر فيه الشروط المنصوص عليها في المادة 87 من الدستور."
  },

  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 135,
    "نص المادة": "المادة 135\nيـحدّد قانـون عضويّ تنظيم المجلس الشّعبيّ الوطنيّ ومجلس الأمّة، وعملهما، وكذا العلاقات الوظيفيّة بينهما وبين الحكومة.\nيحدّد القانون ميزانيّة الغرفتين.\nيعدّ كل من المجلس الشّعبيّ الوطنيّ ومجلس الأمّة نظامه الداخلي ويصادق عليه"
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 136,
    "نص المادة": "المادة 136\nجلسات البرلمان علانيّة.\nتدوّن مداولات البرلمان في محاضر تنشر طبقا للشّروط الّتي يحدّدها القانون العضويّ.\nيمكن لكل من المجلس الشّعبيّ الوطنيّ ومجلس الأمّة أن يعقد جلسات مغلقة بطلب من رئيسه، أو من أغلبيّة أعضائه الحاضرين، أو بطلب من الوزير الأول أو رئيس الحكومة، حسب الحالة."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 137,
    "نص المادة": "المادة 137\nيُشكّل كـل من المجلـس الشّعبيّ الـوطنيّ ومجلـس الأمّة لجانـه الدّائمة في إطـار نظامه الداخلي.\nيمكن كل لجنة دائمة من لجان الغرفتين تشكيل بعثة استعلام مؤقتة حول موضوع محدد أو وضع معيّن.\nيحدد النظام الداخلي لكل غرفة من الغرفتين الأحكام التي تخضع لها البعثة الاستعلامية."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 138,
    "نص المادة": "المادة 138\nيجتمع البرلمان في دورة عادية واحدة كلّ سنة، مدتها عشرة (10) أشهر، وتبتدئ في ثاني يوم عمل من شهر سبتمبر، وتنتهي في آخر يوم عمل من شهر يونيو.\nيمكن الوزير الأول أو رئيس الحكومة، حسب الحالة، طلب تمديد الدورة العادية لأيام معدودة لغرض الانتهاء من دراسة نقطة في جدول الأعمال.\nيمكن أن يجتمع البرلمان في دورة غير عاديّة بمبادرة من رئيس الجمهوريّة.\nيمكن البرلمان كذلك أن يجتمع بناء على استدعاء من رئيس الجمهوريّة بطلب من الوزير الأول أو رئيس الحكومة، حسب الحالة، أو بطلب من ثلثي (3/2) أعضاء المجلس الشّعبيّ الوطنيّ.\nتختَتَم الدّورة غير العاديّة بمجرّد ما يستنفد البرلمان جدول الأعمال الّذي استدعي من أجله."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 139,
    "نص المادة": "المادة 139\nيُشـرّع البرلمان في الميادين الّتي يخصّصها له الدّستــور، وكذلك في المجالات الآتية :\n1) حقـوق الأشخـاص وواجباتهـم الأساسيّة، لا سيّما نظام الحرّيّات العموميّة، وحمايــــــة الحرّيّـات الفرديّة، وواجبـــات المواطنين،\n2) القـواعـد العامـة المتعلّقـة بالأحـوال الشّخصـيّة والأسـرة، لا سيما منها الــزّواج والطّلاق والنسـب والأهليّـة والتّركات،\n3) شروط استقرار الأشخاص،\n4) التّشريع الأساسيّ المتعلّق بالجنسيّة،\n5) القواعد العامّة المتعلّقة بوضعيّة الأجانب،\n6) القواعد المتعلّقة بإنشاء الهيئات القضائيّة،\n7) القواعد العامة لقانون العقوبات، والإجراءات الجزائيّة، لا سيّما تحديد الجنايات والجنح، والعقوبات المختلفة المطابقة لها، والعفو الشّامل، وتسليم المجرمين، ونظام السّجون،\n8) القواعد العامّة للإجراءات المدنيّة والإدارية وطرق التّنفيذ،\n9) نظام الالتزامات المدنيّة والتّجاريّة ونظام الملكيّة،\n10) القواعد العامة المتعلقة بالصفقات العمومية،\n11) التّقسيم الإقليميّ للبلاد،\n12) التصويت على قوانين المالية،\n13) إحـداث الضرائـب والجبايـات والرسـوم والحقـوق المختلفـة، وتحديـد أسسهـا ونسبهـا وتحصيلها،\n14) النّظام الجمركيّ،\n15) نظام إصدار النّقود، ونظام البنوك والقرض والتّأمينات،\n16) القواعد العامّة المتعلّقة بالتّعليم، والبحث العلميّ،\n17) القواعد العامّة المتعلّقة بالصّحّة العموميّة والسكّان،\n18) القواعد العامّة المتعلّقة بقانون العمل والضّمان الاجتماعيّ، وممارسة الحقّ النّقابيّ،\n19) القواعد العامّة المتعلّقة بالبيئة وإطار المعيشة، والتّهيئة العمرانيّة،\n20) القواعد العامّة المتعلّقة بحماية الثّروة الحيوانيّة والنّباتيّة،\n21) حماية التّراث الثّقافيّ والتّاريخيّ والمحافظة عليه،\n22) النّظام العامّ للغابات والأراضي الرّعويّة،\n23) ىالنّظام العامّ للمياه،\n24)النّظام العامّ للمناجم والمحروقات، والطاقات المتجددة،\n25) النّظام العقاريّ،\n26) الضّمانات الأساسيّة للموظّفين، والقانون الأساسيّ العامّ للوظيفة العموميّة،\n27) القواعد العامّة المتعلّقة بالدّفاع الوطنيّ واستعمال السّلطات المدنيّة للقوات المسلّحة،\n28) قواعد نقل الملكيّة من القطاع العامّ إلى القطاع الخاصّ،\n29) إنشاء فئات المؤسّسات،\n30)إنشاء أوسمة الدّولة ونياشينها وألقابها التّشريفيّة"
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 140,
    "نص المادة": "المادة 140\nإضافـة إلى المجـالات المخصّصـة للقـوانـين العضـويّة بموجـب الدّستـور، يشرّع البرلمان بقوانين عضـويّة في المجالات الآتية :\n– تنظيم السّلطات العموميّة، وعملها،\n– نظام الانتخابات،\n– القانون المتعلّق بالأحزاب السّياسيّة،\n– القانون المتعلّق بالإعلام،\n– القانون الأساسيّ للقضاء، والتّنظيم القضائيّ،\n– القانون المتعلّق بقوانين الماليّة.\nتتمّ المصادقة على القانون العضويّ بالأغلبيّة المطلقة للنّوّاب ولأعضاء مجلس الأمة.\nيخضع القانون العضويّ، قبل إصداره، لمراقبة مطابقته للدّستور من طرف المحكمة الدستورية."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 141,
    "نص المادة": "المادة 141\nيمارس رئيـس الجمهـوريّة السّلطـة التّنظيميّة في المسائل غيـر المخصّصـة للقانون.\nيندرج تطبيق القوانين في المجال التّنظيميّ الّذي يعود للوزير الأول أو لرئيس الحكومة، حسب الحالة."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 142,
    "نص المادة": "المادة 142\nلرئيـس الجمهـوريّة أن يشرّع بأوامـر في مسائل عاجلة في حالة شغـور المجلس الشّعبيّ الوطنيّ أو خلال العطلة البرلمانية بعد رأي مجلس الدولة.\nيخطــر رئيس الجمهـورية وجوبا المحكمة الدستورية بشأن دستورية هذه الأوامر، على أن تفصل فيها في أجل أقصاه عشرة (10) أيام.\nيعرض رئيس الجمهوريّة الأوامر الّتي اتّخذها على كلّ غرفة من البرلمان في بداية الدورة القادمة لتوافق عليها.\nتعَــدّ لاغية الأوامر الّتي لا يوافق عليها البرلمان.\nيمكن رئيس الجمهوريّة أن يشرّع بأوامر في الحالة الاستثنائيّة المذكورة في المادّة 98 من الدّستور.\nتتّخذ الأوامر في مجلس الوزراء."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 143,
    "نص المادة": "المادة 143\nلكلّ مـن الوزيـر الأول أو رئيـس الحكومـة، حسـب الحالـة، والنـواب وأعضاء مجلـس الأمـة، حـقّ المبادرة بالقوانين.\nتعرض مشاريع القوانين على مجلس الوزراء، بعد رأي مجلس الدّولة، ثمّ يودعها الوزير الأول أو رئيس الحكومة، حسب الحالة، لدى مكتب المجلس الشّعبيّ الوطنيّ أو مكتب مجلس الأمة."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 144,
    "نص المادة": "\nلمادة 144\nتــــــودع مشاريـــــع القوانــــــين المتعلقــــــة بالتنظيـــــم المحــــلي وتهيئـــــة الإقليــــم والتقسيــــم الإقليمي لدى مكتب مجلس الأمة.\nباستثناء الحالات المبيّنة في الفقرة أعلاه، تودع كل مشاريع القوانين الأخرى لدى مكتب المجلس الشعبي الوطني."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 145,
    "نص المادة": "المادة 145\nمع مراعاة أحكام الفقـرة الأولى من المــــادة 144 أعلاه، يجـــب أن يكون كل مشروع أو اقتراح قانون موضوع مناقشة من طرف المجلس الشّعبيّ الوطنيّ ومجلس الأمّة، على التّوالي، حتّى تتمّ المصادقة عليه.\nتنصبّ مناقشة مشاريع القوانين من طرف المجلس الشّعبيّ الوطنيّ على النّصّ الذي يعرضه عليه الوزير الأول أو رئيس الحكومة، حسب الحالة، أو على النص الذي صادق عليه مجلس الأمة في المسائل المنصوص عليها في المادة 144 أعلاه.\nتعرض الحكومة على إحدى الغرفتين النص الذي صوّتت عليه الغرفة الأخرى. تناقش كل غرفة النص الذي صوّتت عليه الغرفة الأخرى وتصادق عليه.\nوفي كل الحالات، يصادق مجلس الأمة على النص الذي صوّت عليه المجلس الشعبي الوطني بأغلبية أعضائه الحاضرين بالنسبة لمشاريع القوانين العادية، أو بالأغلبية المطلقة بالنسبة لمشاريع القوانين العضوية.\nفي حالة حدوث خلاف بين الغرفتين، يطلب الوزير الأول أو رئيس الحكومة، حسب الحالة، اجتماع لجنة متساوية الأعضاء تتكون من أعضاء من كلتا الغرفتين، في أجل أقصاه خمسة عشر (15) يوما، لاقتراح نص يتعلق بالأحكام محل الخلاف، وتنهي اللجنة نقاشاتها في أجل أقصاه خمسة عشر (15) يوما.\nتعرض الحكومة هذا النّصّ على الغرفتين للمصادقة عليه، ولا يمكن إدخال أيّ تعديل عليه إلاّ بموافقة الحكومة.\nفي حالة استمرار الخلاف بين الغرفتين، يمكن الحكومة أن تطلب من المجلس الشعبي الوطني الفصل نهائيا. وفي هذه الحالة، يأخذ المجلس الشعبي الوطني بالنص الذي أعدته اللجنة المتساوية الأعضاء أو، إذا تعذر ذلك، بالنص الأخير الذي صوّت عليه.\nيُسحب النص إذا لم تخطر الحكومة المجلس الشعبي الوطني طبقا للفقرة السابقة."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 146,
    "نص المادة": "المادة 146\nيصادق البرلمان على قانون الماليّة في مدّة أقصاها خمسة وسبعون (75) يوما من تاريخ إيداعه.\nفي حالة عدم المصادقة عليه في الأجل المحدّد سابقا، يصدر رئيس الجمهوريّة مشروع الحكومة بأمر.\nتحدّد الإجراءات الأخرى بموجب القانون العضويّ المذكور في المادّة 135 من الدّستور."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 147,
    "نص المادة": "المادة 147\nلا يُقـــــــبَل أيّ اقتــــــراح قانــــون أو تعــــــديـــــــل قانــــون يقدمـــه أعضــــاء البرلمــــان، يكــــــون مضمونـــه أو نتيجتــه تخفيض الموارد العموميّة، أو زيادة النّفقات العمومـــيّـة، إلاّ إذا كان مرفوقا بتدابير تستهدف الزّيادة في إيرادات الدّولة، أو توفير مبالغ ماليّة في فصل آخر من النّفقات العموميّة تساوي، على الأقل، المبالغ المقترح إنفاقها."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 148,
    "نص المادة": "المادة 148\nيُصـدِر رئيـس الجمهوريّة القانون في أجـل ثلاثين (30) يوما، ابتـداء مـن تاريخ تسلّمه إيّاه.\nغير أنّه إذا أَخطَرت سلطة من السّلطات المنصوص عليها في المادّة 193 أدناه المحكمة الدستورية، قبل صدور القانون، يوقف هذا الأجل حتّى تفصل في ذلك المحكمة الدستورية وفق الشّروط الّتي تحدّدها المادّة 194 أدناه."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 149,
    "نص المادة": "المادة 149\nيمكـن رئيـس الجمهـوريّة أن يطلـب قراءة ثانيــة في قانون تمّ التّصويت عليه في غضون الثّلاثين (30) يوما الموالية لتاريخ المصادقة عليه.\nفي هذه الحالة، لا تتم المصادقة على القانون إلاّ بأغلبيّة ثلثي (3/2) أعضاء المجلس الشّعبيّ الوطنيّ وأعضاء مجلس الأمة."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 150,
    "نص المادة": "المادة 150\nيمكن رئيس الجمهوريّة أن يوجّه خطابا إلى البرلمان."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 151,
    "نص المادة": "المادة 151\nيمكن رئيـس الجمهـوريّة أن يقـرّر حلّ المجلـس الشّعبيّ الوطنيّ، أو إجـراء انتخابات تشريعيّة قبل أوانها، بعد استشارة رئيس مجلس الأمّة، ورئيس المجلس الشّعبيّ الوطنيّ، ورئيس المحكمة الدستورية، والوزير الأول أو رئيس الحكومة، حسب الحالة.\nتجرى هذه الانتخابات، في كلتا الحالتين، في أجل أقصاه ثلاثة (3) أشهر، وإذا تعذّر تنظيمها في هذا الأجل لأيّ سبب كان، يمكن تمديد هذا الأجل لمدة أقصاها ثلاثة (3) أشهر بعد أخذ رأي المحكمة الدستورية."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 152,
    "نص المادة": "المادة 152\nيمكن البرلمان أن يفتح مناقشة حول السّياسة الخارجيّة بناء على طلب رئيس الجمهوريّة أو رئيس إحدى الغرفتين.\nيمكن أن تتوّج هذه المناقشة، عند الاقتضاء، بإصدار البرلمان المنعقد بغرفتيه المجتمعتين معا، لائحة يبلّغها إلى رئيس الجمهوريّة."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 153,
    "نص المادة": "المادة 153\nيصـادق رئيـس الجمهوريّة على اتّفاقيّات الهدنـة، ومعاهـــدات السّلـم، والتّحالف والاتّحاد، والمعاهدات المتعلّقة بحدود الدّولة والمعاهدات المتعلّقة بقانون الأشخاص، والمعاهدات الّتي تترتّب عليها نفقات غير واردة في ميزانيّة الدّولة، والاتفاقات الثنائية أو المتعددة الأطراف المتعلقة بمناطق التبادل الحرّ والشراكة وبالتكامل الاقتصادي، بعد أن توافق عليها كلّ غرفة من البرلمان صراحة."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 154,
    "نص المادة": "المادة 154\nالمعاهدات الّتي يصـادق عليهـا رئيس الجمهوريّة، حسب الشّروط المنصوص عليها في الدّستور، تسمو على القانون"
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 155,
    "نص المادة": "المادة 155\nتقدم الحكومـة المعلومات والوثائـق الضروريـة التي يطلبهـا البرلمان عنـد ممارسة مهامه الرقابية."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 156,
    "نص المادة": "المادة 156\nتقدّم الحكومة لكلّ غرفة من البرلمان عرضا عن استعمال الاعتمادات الماليّة الّتي أقرّتها لكلّ سنة ماليّة.\nتُختَتم السّنة الماليّة فيما يخصّ البرلمان، بالتّصويت على قانون يتضمّن تسوية ميزانيّة السّنة الماليّة المعنيّة من قِبَل كلّ غرفة من البرلمان."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 157,
    "نص المادة": "المادة 157\nيمكن للجان البرلمانية سماع أعضاء الحكومة حول كل مسألة تتعلق بالمصلحة العامة."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 158,
    "نص المادة": "المادة 158\nيمكن أعضـاء البرلمـان أن يوجّهـوا أيّ سؤال شفويّ أو كتابيّ إلى أيّ عضـو في الحكومة.\nيكون الجواب عن السّؤال الكتابيّ كتابيّا خلال أجل أقصاه ثلاثون (30) يوما.\nبالنسبة للأسئلة الشفوية، يجب ألاّ يتعدى أجل الجواب ثلاثين (30) يوما.\nيعقد كل من المجلـس الشعبـي الوطني ومجلس الأمة، بالتداول، جلسة أسبوعية تخصص لأجوبة الحكومة على الأسئلة الشفوية للنواب وأعضاء مجلس الأمة.\nإذا رأت أيّ من الغرفتين أنّ جواب عضو الحكومة، شفويّا كان أو كتابيّا، يبرّر إجراء مناقشة، تجري المناقشة حسب الشّروط الّتي ينصّ عليها النّظام الدّاخليّ للمجلس الـشـّعـبيّ الوطنيّ ومجلس الأمّة.\nتنشر الأسئلة والأجوبة طبقا للشّروط الّتي يخضع لها نشر محاضر مناقشات البرلمان."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 159,
    "نص المادة": "المادة 159\nيمكن كلّ غرفة مـــن البرلمان، في إطار اختصاصاتهـــا، أن تنشــئ في أيّ وقت لجان تحقيق في قضايا ذات مصلحة عامّة.\nلا يمكن إنشاء لجنة تحقيق بخصوص وقائع تكون محل إجراء قضائي."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 160,
    "نص المادة": "المادة 160\nيمكن أعضاء البرلمان استجواب الحكومة في أية مسألة ذات أهمية وطنية، وكذا عن حال تطبيق القوانين. ويكون الجواب خلال أجل أقصاه ثلاثون (30) يوما."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 161,
    "نص المادة": "المادة 161\nيمكن المجلس الشّعبيّ الوطنيّ لدى مناقشته بيان السّياسة العامّة أو على إثر استجواب، أن يصوّت على ملتمس رقابة ينصبّ على مـسـؤولــيّـة الحكومة.\nلا يُقبل هذا الملتمس إلاّ إذا وقّعه سُبُع (7/1) عدد النّوّاب، على الأقلّ."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 4,
    "اسم الفصل": "البرلمان ",
    "رقم المادة": 162,
    "نص المادة": "المادة 162\nتتمّ الموافقة على ملتمس الرّقابة بتصويت أغلبيّة ثلثي (3/2) النّوّاب.\nلا يتمّ التّصويت إلاّ بعد ثلاثة (3) أيّام من تاريخ إيداع ملتمس الرّقابة.\nإذا صادق المجلس الشّعبيّ الوطنيّ على ملتمس الرّقابة، يقدّم الوزير الأول أو رئيس الحكومة، حسب الحالة، استقالة الحكومة إلى رئيس الجمهوريّة."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 5,
    "اسم الفصل": "القضاء ",
    "رقم المادة": 163,
    "نص المادة": "المادة 163\nالقضاء سلطة مستقلة.\nالقاضي مستقل، لا يخضع إلا للقانون ."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 5,
    "اسم الفصل": "القضاء ",
    "رقم المادة": 164,
    "نص المادة": "المادة 164\nيحمي القضاء المجتمع وحرّيات وحقوق المواطنين طبقا للدستور."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 5,
    "اسم الفصل": "القضاء ",
    "رقم المادة": 165,
    "نص المادة": "المادة 165\nيقوم القضاء على أساس مبادئ الشّرعيّة والمساواة.\nالقضاء متاح للجميع.\nيضمن القانون التقاضي على درجتين، و يحدد شروط و إجراءات تطبيقه."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 5,
    "اسم الفصل": "القضاء ",
    "رقم المادة": 166,
    "نص المادة": "المادة 166\nيصدر القضاء أحكامه باسم الشعب."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 5,
    "اسم الفصل": "القضاء ",
    "رقم المادة": 167,
    "نص المادة": "المادة 167\nتخضع العقوبات الجزائيّة لمبدأي الشّرعيّة والشّخصيّة."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 5,
    "اسم الفصل": "القضاء ",
    "رقم المادة": 168,
    "نص المادة": "المادة 168\nينظر القضاء في الطعون في قرارات السلطات الإدارية."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 5,
    "اسم الفصل": "القضاء ",
    "رقم المادة": 169,
    "نص المادة": "المادة 169\nتعلّل الأحكام والأوامر القضائية.\nيُنطَق بالأحكام القضائية في جلسات علنيّة."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 5,
    "اسم الفصل": "القضاء ",
    "رقم المادة": 170,
    "نص المادة": "المادة 170\nيمكن أن يُساعد القضـاة، في ممارسة مهامهم القضائية، مساعدون شعبيّون وفق الشروط الّتي يحدّدهــا القانون."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 5,
    "اسم الفصل": "القضاء ",
    "رقم المادة": 171,
    "نص المادة": "المادة 171\nيلتزم القاضي في ممارسة وظيفته بتطبيق المعاهدات المصادق عليهـا، وقوانين الجمهورية وكذا قرارات المحكمة الدستورية."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 5,
    "اسم الفصل": "القضاء ",
    "رقم المادة": 172,
    "نص المادة": "المادة 172\nقاضي الحكم غير قابل للنقل إلاّ ضمن الشروط المحددة في الفقرة الثانية أدناه.\nلا يعزل القاضي، ولا يمكن إيقافه عن العمل أو إعفاؤه أو تسليط عقوبة تأديبية عليه أثناء ممارسة مهامه أو بمناسبتها، إلا في الحالات وطبق الضمانات التي يحددها القانون بموجب قرار معلل من المجلس الأعلى للقضاء.\nيخطر القاضي المجلس الأعلى للقضاء في حالة تعرضه لأي مساس باستقلاليته.\nتحمي الدولة القاضي وتجعله في منأى عن الاحتياج.\nيحدد قانون عضوي كيفيات تطبيق هذه المادة."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 5,
    "اسم الفصل": "القضاء ",
    "رقم المادة": 173,
    "نص المادة": "المادة 173\nيمتنع القاضي عن كل ما يخل بواجبات الاستقلالية والنزاهة. ويلتزم بواجب التحفظ.\nالقاضي مسؤول أمام المجلس الأعلى للقضاء عن كيفيّة أدائه لمهمته، وفق الأشكال والإجراءات التي يحددها القانون."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 5,
    "اسم الفصل": "القضاء ",
    "رقم المادة": 174,
    "نص المادة": "المادة 174\nيحمي القانون المتقاضي من أيّ تعسّف يصدر عن القاضي."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 5,
    "اسم الفصل": "القضاء ",
    "رقم المادة": 175,
    "نص المادة": "المادة 175\nالحقّ في الدّفاع معترف به.\nالحقّ في الدفاع مضمون في القضايا الجزائية."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 5,
    "اسم الفصل": "القضاء ",
    "رقم المادة": 176,
    "نص المادة": "المادة 176\nيستفيد المحامي من الضمانات القانونية التي تكفل له الحماية من كل أشكال الضغوط، وتمكّنه من ممارسة مهنته بكل حرية في إطار القانون."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 5,
    "اسم الفصل": "القضاء ",
    "رقم المادة": 177,
    "نص المادة": "المادة 177\nيحق للمتقاضي المطالبة بحقوقه أمام الجهات القضائية، ويمكنه أن يستعين بمحامٍ خلال كل الإجراءات القضائية."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 5,
    "اسم الفصل": "القضاء ",
    "رقم المادة": 178,
    "نص المادة": "المادة 178\nكلّ أجهزة الدّولة المختصّة مطالبة في كلّ وقت وفي كلّ مكان، وفي جميع الظّروف، بالسهر على تنفيذ أحكام القضاء.\nيعاقب القانون كل من يمس باستقلالية القاضي، أو يعرقل حسن سير العدالة وتنفيذ قراراتها."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 5,
    "اسم الفصل": "القضاء ",
    "رقم المادة": 179,
    "نص المادة": "المادة 179\nتمثّل المحكمة العليا الهيئة المقوّمة لأعمال المجالس القضائيّة والمحاكم.\nيمثّل مجلس الدولة الهيئة المقوّمة لأعمال المحاكم الإدارية للاستئناف والمحاكم الإدارية والجهات الأخرى الفاصلة في المواد الإدارية.\nتضمن المحكمة العليا ومجلس الدّولة توحيد الاجتهاد القضائي في جميع أنحاء البلاد، ويسهران على احترام القانون.\nتفصل محكمة التنازع في حالات تنازع الاختصاص بين هيئات القضاء العادي وهيئات القضاء الإداري.\nيحدّد قانون عضويّ تنظيم المحكمة العليا ومجلس الدّولة ومحكمة التّنازع، وسيرها واختصاصاتها."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 5,
    "اسم الفصل": "القضاء ",
    "رقم المادة": 180,
    "نص المادة": "المادة 180\nيضمن المجلس الأعلى للقضاء استقلالية القضاء.\nيرأس رئيس الجمهورية المجلس الأعلى للقضاء.\nيمكن رئيس الجمهورية أن يكلف الرئيس الأول للمحكمة العليا برئاسة المجلس.\n– يتشكل المجلس الأعلى للقضاء من :\n– الرئيس الأول للمحكمة العليا، نائبا للرئيس،\n– رئيس مجلس الدولة،\n– خمسة عشر (15) قاضيا ينتخبون من طرف زملائهم حسب التوزيع الآتي:\n* ثلاثة (3) قضاة من المحكمة العليا، من بينهم قاضيان اثنان (2) للحكم وقاضٍ واحد (1) من النيابة العامة،\n* ثلاثة (3) قضاة مـن مجلس الدولة، مـــن بينهم قاضيان اثنان (2) للحكم ومحافظ الدولة (1)،\n* ثلاثة (3) قضاة من المجالس القضائية، من بينهم قاضيان اثنان (2) للحكم وقاضٍ واحد (1) من النيابة العامة،\n* ثلاثة (3) قضاة من الجهات القضائية الإدارية غير قضاة مجلس الدولة، من بينهم قاضيان اثنان (2) للحكم ومحافظ الدولة  (1)،\n* ثلاثة (3) قضاة من المحاكم الخاضعة للنظام القضائي العادي، من بينهم قاضيان اثنان (2) للحكم وقاضٍ واحد (1) من النيابة العامة.\n– ست (6) شخصيات يختارون بحكم كفاءاتهـــم خارج سلك القضاء، اثنان (2) منهم يختــارهما رئيس الجمهورية، واثنان (2) يختارهما رئيس المجلس الشعبي الوطني من غير النواب، واثنان (2) يختارهما رئيس مجلس الأمة من غير أعضائه،\n– قاضيان اثنان (2) من التشكيل النقابي للقضاة،\n– رئيس المجلس الوطني لحقوق الإنسان.\nيحدد قانون عضوي طرق انتخاب أعضاء المجلس الأعلى للقضاء وقواعد تنظيمه وعمله."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 5,
    "اسم الفصل": "القضاء ",
    "رقم المادة": 181,
    "نص المادة": "المادة 181\nيقرر المجلس الأعلى للقضـاء، طبقا للشروط التي يحددها القانون، تعيين القضاة ونقلهـــم ومسارهــم الوظيفي.\nيتم التعيين في الوظائف القضائية النوعية بموجب مرسوم رئاسي بعد رأي مطابق للمجلس الأعلى للقضاء.\nيسهر على احترام أحكام القانون الأساسي للقضاء وعلى رقابة انضباط القضاة تحت رئاسة الرئيس الأول للمحكمة العليا."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 5,
    "اسم الفصل": "القضاء ",
    "رقم المادة": 182,
    "نص المادة": "المادة 182\nيبدي المجلس الأعلى للقضاء رأيا استشاريّا قبليّاً في ممارسة رئيس الجمهوريّة حقّ العفو."
  },
  {
    "رقم الباب": 3,
    "اسم الباب": " تنظيم السلطات والفصل بينها",
    "رقم الفصل": 6,
    "اسم الفصل": "المحكمـة العليا للدولة",
    "رقم المادة": 183,
    "نص المادة": "المادة 183\nتختص المحكمة العليا للدّولة بالنظر في الأفعال التي يمكن تكييفها خيانة عظمى، والتي يرتكبها رئيس الجمهورية أثناء ممارسة عهدته.\nتختص المحكمة العليا للدولة بالنظر في الجنايات والجنح الّتي يرتكبها الوزير الأول ورئيس الحكومة بمناسبة تأدية مهامهما.\nيحدّد قانون عضويّ تشكيلة المحكمة العليا للدّولة وتنظيمها وسيرها وكذلك الإجراءات المطبّقة أمامها."
  },

  {
    "رقم الباب": 4,
    "اسم الباب": " مؤسسات الرقابة",
    "رقم الفصل": 1,
    "اسم الفصل": "المحكمـة الدستورية",
    "رقم المادة": 185,
    "نص المادة": "المادة 185\nالمحكمة الدستورية مؤسسة مستقلة مكلفة بضمان احترام الدّستور.\nتضبط المحكمة الدستورية سير المؤسسات ونشاط السلطات العمومية.\nتحدد المحكمة الدستورية قواعد عملها"
  },
  {
    "رقم الباب": 4,
    "اسم الباب": " مؤسسات الرقابة",
    "رقم الفصل": 1,
    "اسم الفصل": "المحكمـة الدستورية",
    "رقم المادة": 186,
    "نص المادة": "المادة 186\nتتشكل المحكمة الدستورية من اثني عشر (12) عضوا :\n– أربعة (4) أعضاء يعيّنهم رئيس الجمهوريّة من بينهم رئيس المحكمة،\n– عضو واحد (1) تنتخبه المحكمة العليا من بين أعضائها، وعضو واحد (1) ينتخبه مجلس الدّولة من بين أعضائه،\n– ستة (6) أعضاء ينتخبون بالاقتراع من أساتذة القانون الدستوري. يحــــدد رئيــــس الجمهوريـــة شــــروط وكيفيــــات انتخاب هؤلاء الأعضاء.\nيؤدي أعضاء المحكمة الدستورية، قبل مباشرة مهامهم، اليمين أمام الرئيس الأول للمحكمة العليا، حسب النص الآتي:\n“أقسم بالله العلي العظيم أن أمارس وظـائفي بنزاهة وحياد، وأحفظ سرّية المداولات وأمتنع عن اتخـاذ موقف علني في أيّ قضية تخضع لاختصاص المحكمة الدستورية”."
  },
  {
    "رقم الباب": 4,
    "اسم الباب": " مؤسسات الرقابة",
    "رقم الفصل": 1,
    "اسم الفصل": "المحكمـة الدستورية",
    "رقم المادة": 187,
    "نص المادة": "المادة 187\nيُشترط في عضو المحكمة الدستورية المنتخب أو المعيّن:\n– بلوغ خمسين (50) سنة كاملة يوم انتخابه أو تعيينه،\n– التمتع بخبرة في القانون لا تقل عن عشرين (20) سنة، واستفاد من تكويــن في القانون الدستوري،\n– التمتع بالحقوق المدنية والسياسية، وألاّ يكون محكوما عليه بعقوبة سالبة للحرية،\n– عدم الانتماء الحزبي.\nبمجرّد انتخاب أعضاء المحكمة الدّستوريّة أو تعيينهم، يتوقّفون عن ممارسة أيّ عضويّة أو أيّ وظيفة أو تكليف أو مهمّة أخرى، أو أي نشاط آخر أو مهنة حرة."
  },
  {
    "رقم الباب": 4,
    "اسم الباب": " مؤسسات الرقابة",
    "رقم الفصل": 1,
    "اسم الفصل": "المحكمـة الدستورية",
    "رقم المادة": 188,
    "نص المادة": "المادة 188\nيعيّن رئيس الجمهوريّة رئيس المحكمة الدستورية لعهدة واحدة مدّتها ست (6) سنوات، على أن تتوفر فيه الشروط المنصوص عليها في المادة 87 من الدستور باستثناء شرط السن.\nيضطلع أعضاء المحكمة الدستورية بمهامّهم مرّة واحدة مدّتها ست (6) سنوات، ويجدّد نصف عدد أعضاء المحكمـــة الدستورية كلّ ثلاث (3) سنوات.\nيحدد النظام الداخلي للمحكمة الدستورية شروط وكيفيات التجديد الجزئي."
  },

  {
    "رقم الباب": 4,
    "اسم الباب": " مؤسسات الرقابة",
    "رقم الفصل": 1,
    "اسم الفصل": "المحكمـة الدستورية",
    "رقم المادة": 189,
    "نص المادة": "المادة 189\nيتمتع أعضاء المحكمة الدستورية بالحصانة عن الأعمال المرتبطة بممارسة مهامهم.\nلا يمكن أن يكون عضو المحكمة الدستورية محل متابعة قضائية بسبب الأعمال غير المرتبطة بممارسة مهامه إلاّ بتنازل صريح منه عن الحصانة أو بإذن من المحكمة الدستورية.\nيحدد النظام الداخلي للمحكمة الدستورية إجراءات رفع الحصانة."
  },
  {
    "رقم الباب": 4,
    "اسم الباب": " مؤسسات الرقابة",
    "رقم الفصل": 1,
    "اسم الفصل": "المحكمـة الدستورية",
    "رقم المادة": 190,
    "نص المادة": "المادة 190\nبالإضافة إلى الاختصاصات التي خولتها إياها صراحة أحكام أخرى في الدستور، تفصِل المحكمة الدستورية بقرار في دستورية المعاهدات والقوانين والتنظيمات.\nيمكن إخطار المحكمة الدستورية بشأن دستورية المعاهدات قبل التصديق عليها، والقوانين قبل إصدارها.\nيمكن إخطار المحكمة الدستورية بشأن دستورية التنظيمات خلال شهر من تاريخ نشرها.\nتفصل المحكمة الدستورية بقرار حول توافق القوانين والتنظيمـات مع المعاهدات، ضمن الشروط المحددة، على التوالي، في الفقرتين 2 و3 أعلاه.\nيُخطِر رئيس الجمهوريّة المحكمة الدستورية وجوبا، حول مطابقة القوانين العضويّة للدستور بعد أن يصـادق عليها البرلمان. وتفصل المحكمة الدستورية بقرار بشأن النص كله.\nتفصِل المحكمة الدستورية في مطابقة النّظام الدّاخلي لكلّ من غرفتي البرلمان للدستور، حسب الإجراءات المذكورة في الفقرة السّابقة."
  },
  {
    "رقم الباب": 4,
    "اسم الباب": " مؤسسات الرقابة",
    "رقم الفصل": 1,
    "اسم الفصل": "المحكمـة الدستورية",
    "رقم المادة": 191,
    "نص المادة": "المادة 191\nتنظر المحكمة الدستورية في الطعون التي تتلقاها حول النتائج المؤقتة للانتخابات الرئاسية والانتخابات التشريعية والاستفتاء، وتعلن النتائج النهائية لكل هذه العمليات."
  },
  {
    "رقم الباب": 4,
    "اسم الباب": " مؤسسات الرقابة",
    "رقم الفصل": 1,
    "اسم الفصل": "المحكمـة الدستورية",
    "رقم المادة": 192,
    "نص المادة": "المادة 192\nيمكن إخطار المحكمة الدستورية من طرف الجهات المحددة في المادة 193 أدناه، بشأن الخلافات التي قد تحدث بين السلطات الدستورية.\nيمكن لهذه الجهات إخطار المحكمة الدستورية حول تفسير حكم أو عدة أحكام دستورية، وتبدي المحكمة الدستورية رأيا بشأنها."
  },

  {
    "رقم الباب": 4,
    "اسم الباب": " مؤسسات الرقابة",
    "رقم الفصل": 1,
    "اسم الفصل": "المحكمـة الدستورية",
    "رقم المادة": 193,
    "نص المادة": "المادة 193\nتخطر المحكمة الدستورية من رئيس الجمهورية أو رئيس مجلس الأمة أو رئيس المجلس الشعبي الوطني أو من الوزير الأول أو رئيس الحكومة، حسب الحالة.\nيمكن إخطارها كذلك من أربعين (40) نائبا أو خمسة وعشرين (25) عضوا في مجلس الأمة.\nلا تمتد ممارسة الإخطار المبيـّن في الفقرتين الأولى والثانية إلى الإخطار بالدفع بعدم الدستورية المبيّن في المادة 195 أدناه."
  },
  {
    "رقم الباب": 4,
    "اسم الباب": " مؤسسات الرقابة",
    "رقم الفصل": 1,
    "اسم الفصل": "المحكمـة الدستورية",
    "رقم المادة": 194,
    "نص المادة": "المادة 194\nتتداول المحكمة الدستورية في جلسة مغلقة، وتصدر قرارها في ظرف ثلاثين (30) يومـا من تاريـخ إخطارها. وفـي حال وجود طارئ، وبطلب من رئيس الجمهوريــة، يخفّض هذا الأجـل إلـى عشرة (10) أيام."
  },
  {
    "رقم الباب": 4,
    "اسم الباب": " مؤسسات الرقابة",
    "رقم الفصل": 1,
    "اسم الفصل": "المحكمـة الدستورية",
    "رقم المادة": 195,
    "نص المادة": "المادة 195\nيمكن إخطار المحكمة الدستورية بالدفع بعدم الدستورية بناء على إحالة من المحكمة العليا أو مجلس الدولة، عندما يدعي أحد الأطراف في المحاكمة أمام جهة قضائية أن الحكم التشريعي أو التنظيمي الذي يتوقف عليه مآل النزاع ينتهك حقوقه وحرياته التي يضمنها الدستور.\nعندما تُخطر المحكمة الدستورية على أساس الفقرة أعلاه، فإن قرارها يصدر خلال الأشهر الأربعة (4) التي تلي تاريخ إخطارها. ويمكن تمديد هذا الأجل مرة واحدة لمدة أقصاها أربعة (4) أشهر، بناء على قرار مسبّب من المحكمة ويبلغ إلى الجهة القضائية صاحبة الإخطار."
  },
  {
    "رقم الباب": 4,
    "اسم الباب": " مؤسسات الرقابة",
    "رقم الفصل": 1,
    "اسم الفصل": "المحكمـة الدستورية",
    "رقم المادة": 196,
    "نص المادة": "المادة 196\nيحدد قانون عضوي إجراءات وكيفيات الإخطار والإحالة المتبعة أمام المحكمة الدستورية."
  },
  {
    "رقم الباب": 4,
    "اسم الباب": " مؤسسات الرقابة",
    "رقم الفصل": 1,
    "اسم الفصل": "المحكمـة الدستورية",
    "رقم المادة": 197,
    "نص المادة": "المادة 197\nتُتخذ قرارات المحكمة الدستورية بأغلبية أعضائها الحاضرين، وفي حالـة تساوي عدد الأصوات يكون صوت الرئيس مرجّحا.\nتُتخذ القرارات المتعلقة برقابة القوانين العضوية بالأغلبية المطلقة للأعضاء."
  },
  {
    "رقم الباب": 4,
    "اسم الباب": " مؤسسات الرقابة",
    "رقم الفصل": 1,
    "اسم الفصل": "المحكمـة الدستورية",
    "رقم المادة": 198,
    "نص المادة": "المادة 198\nإذا قررت المحكمة الدستورية عدم دستوريّة معاهدة أو اتّفاق أو اتّفاقيّة، فلا يتمّ التّصديق عليها.\nإذا قررت المحكمة الدستورية عدم دستورية قانون، لا يتم إصداره.\nإذا قررت المحكمة الدستورية عدم دستورية أمر أو تنظيم، فإن هذا النص يفقد أثره، ابتداء من يوم صدور قرار المحكمة الدستورية.\nإذا قررت المحكمة الدستورية أنّ نصّا تشريعيّا أو تنظيميّا غير دستوريّ على أساس المادة 195 أعلاه، يفقد أثره ابتداء من اليوم الذي يحدّده قرار المحكمة الدستورية.\nتكون قرارات المحكمة الدستورية نهائية وملزمة لجميع السلطات العمومية والسلطات الإدارية والقضائية."
  },
  {
    "رقم الباب": 4,
    "اسم الباب": " مؤسسات الرقابة",
    "رقم الفصل": 2,
    "اسم الفصل": "مجلس المحاسبة",
    "رقم المادة": 199,
    "نص المادة": "المادة 199\nمجلس المحاسبة مؤسسة عليا مستقلة للرقابة على الممتلكات والأموال العمومية. يكلّف بالرّقابة البعديّة على أموال الدّولة والجماعات المحليّة والمرافق العموميّة، وكذلك رؤوس الأموال التجارية التابعة للدولة.\nيساهم مجلس المحاسبة في ترقية الحكم الراشد والشفافية في تسيير الأموال العمومية وإيداع الحسابات.\nيعيّن رئيس الجمهورية رئيس مجلس المحاسبة لعهدة مدتها خمس (5) سنوات قابلة للتجديد مرة واحدة.\nيعدّ مجلس المحاسبة تقريرا سنويّا يرفعه إلى رئيس الجمهوريّة. ويتولى رئيس المجلس نشره.\nيحدّد قانون عضوي تنظيم مجلس المحاسبة وعمله واختصاصاته والجزاءات المترتبة عن تحرياته، والقانون الأساسي لأعضائه. كما يحدد علاقاته بالهياكل الأخرى في الدولة المكلفة بالرقابة والتفتيش ومكافحة الفساد."
  },
  {
    "رقم الباب": 4,
    "اسم الباب": " مؤسسات الرقابة",
    "رقم الفصل": 3,
    "اسم الفصل": "السلطة الوطنية المستقلة للانتخابات",
    "رقم المادة": 200,
    "نص المادة": "المادة 200\nالسلطة الوطنية المستقلة للانتخابات مؤسسة مستقلة."
  },
  {
    "رقم الباب": 4,
    "اسم الباب": " مؤسسات الرقابة",
    "رقم الفصل": 3,
    "اسم الفصل": "السلطة الوطنية المستقلة للانتخابات",
    "رقم المادة": 201,
    "نص المادة": "المادة 201\nيعيّن رئيـــس الجمهورية رئيس السلطة الوطنية المستقلة للانتخابات وأعضاءها، لعهدة واحدة (1) مدتها ست (6) سنوات غير قابلة للتجديد.\nيشترط في أعضاء السلطة الوطنية المستقلة للانتخابات عدم الانتماء إلى أي حزب سياسي.\nيحدد القانون العضوي المتعلق بنظام الانتخابات قواعد تنظيم السلطة الوطنية المستقلة للانتخابات وسيرها وصلاحياتها."
  },
  {
    "رقم الباب": 4,
    "اسم الباب": " مؤسسات الرقابة",
    "رقم الفصل": 3,
    "اسم الفصل": "السلطة الوطنية المستقلة للانتخابات",
    "رقم المادة": 202,
    "نص المادة": "المادة 202\nتتولّى السلطة الوطنية المستقلة للانتخابات مهمة تحضير وتنظيم وتسيير الانتخابـات الرئاسية والتشريعية والمحلية وعمليات الاستفتاء والإشراف عليها.\nتمارس السلطة الوطنية المستقلة للانتخابات عمليات التسجيل في القوائم الانتخابية ومراجعتها، وعمليات تحضير العملية الانتخابية، وعمليات التصويت والفرز والبت في النزاعات الانتخابية حسب التشريع الساري المفعول.\nتمارس السلطة الوطنية المستقلة للانتخابات مهامها منذ تاريخ استدعاء الهيئة الانتخابية حتى إعلان النتائج المؤقتة للاقتراع.\nتمارس السلطة الوطنية المستقلة للانتخابات مهامها في شفافية وحياد وعدم تحيّز."
  },
  {
    "رقم الباب": 4,
    "اسم الباب": " مؤسسات الرقابة",
    "رقم الفصل": 3,
    "اسم الفصل": "السلطة الوطنية المستقلة للانتخابات",
    "رقم المادة": 203,
    "نص المادة": "المادة 203\nتقدم السلطات العمومية المعنية الدعم الضـروري للسلطة الوطنية المستقلة للانتخابات لممارسة مهامها."
  },
  {
    "رقم الباب": 4,
    "اسم الباب": " مؤسسات الرقابة",
    "رقم الفصل": 3,
    "اسم الفصل": "السلطة العليا للشفافية والوقاية من الفساد ومكافحته",
    "رقم المادة": 204,
    "نص المادة": "المادة 204\nالسلطة العليا للشفافية والوقاية من الفساد ومكافحته مؤسسة مستقلة."
  },
  {
    "رقم الباب": 4,
    "اسم الباب": " مؤسسات الرقابة",
    "رقم الفصل": 3,
    "اسم الفصل": "السلطة العليا للشفافية والوقاية من الفساد ومكافحته",
    "رقم المادة": 205,
    "نص المادة": "المادة 205\nتتولى السلطة العليا للشفافية والوقاية من الفساد ومكافحته على الخصوص المهام الآتية:\n– وضع استراتيجية وطنية للشفافية والوقاية من الفساد ومكافحته، والسهر على تنفيذها ومتابعاتها،\n– جمع ومعالجة وتبليغ المعلومات المرتبطة بمجال اختصاصها، ووضعها في متناول الأجهزة المختصة،\n– إخطار مجلس المحاسبة والسلطة القضائية المختصة كلّما عاينت وجود مخالفات، وإصدار أوامر، عند الاقتضاء، للمؤسسات والأجهزة المعنية،\n– المساهمة في تدعيم قدرات المجتمع المدني والفاعلين الآخرين في مجال مكافحة الفساد،\n– متابعة وتنفيذ ونشر ثقافة الشفافية والوقاية ومكافحة الفساد،\n– إبداء الرأي حول النصوص القانونية ذات الصلة بمجال اختصاصها،\n– المشاركة في تكوين أعوان الأجهزة المكلفة بالشفافية والوقاية ومكافحة الفساد،\n–المساهمة في أخلقة الحياة العامة وتعزيز مبادئ الشفافية والحكم الراشد والوقاية ومكافحة الفساد.\nيحدد القانون تنظيم وتشكيل السلطة العليا للشفافية والوقاية من الفساد ومكافحته، وكذا صلاحياتها الأخرى."
  },

  {
    "رقم الباب": 5,
    "اسم الباب": " الهيئات الاسـتـشـاريـة",
    "رقم الفصل": 1,
    "اسم الفصل": "المجلس الإسلامي الأعلى",
    "رقم المادة": 206,
    "نص المادة": "المادة 206\nالمجلس الإسلامي الأعلى هيئـــة استشارية لدى رئيـس الجمهوريّة. يتــــولّى على وجه الخصوص:\n– الحثّ على الاجتهاد وترقيته،\n– إبداء الحكم الشّرعيّ فيما يُعرَض عليه،\n– رفع تقرير دوريّ عن نشاطه إلى رئيس الجمهوريّة."
  },
  {
    "رقم الباب": 5,
    "اسم الباب": " الهيئات الاسـتـشـاريـة",
    "رقم الفصل": 1,
    "اسم الفصل": "المجلس الإسلامي الأعلى",
    "رقم المادة": 207,
    "نص المادة": "المادة 207\nيتكـوّن المجلس الإسلاميّ الأعلى من خمسة عشر (15) عضوا، منهم الرّئيس، يعيّنهم رئيس الجمهوريّة من بين الكفاءات الوطنيّة العليا في مختلف العلوم."
  },
  {
    "رقم الباب": 5,
    "اسم الباب": " الهيئات الاسـتـشـاريـة",
    "رقم الفصل": 2,
    "اسم الفصل": "المجلس الأعلى للأمن",
    "رقم المادة": 208,
    "نص المادة": "المادة 208\nيرأس رئيس الجمهورية المجلس الأعلى للأمن.\nيقدم المجلس الأعلى للأمن لرئيس الجمهورية آراء في المسائل المتعلّقة بالأمن الوطنيّ.\nيحدّد رئيس الجمهورية كيفيّات تنظيم المجلس الأعلى للأمن وسيره."
  },
  {
    "رقم الباب": 5,
    "اسم الباب": " الهيئات الاسـتـشـاريـة",
    "رقم الفصل": 3,
    "اسم الفصل": "المجلس الوطني الاقتصادي والاجتماعي والبيئي",
    "رقم المادة": 209,
    "نص المادة": "المادة 209\nالمجلس الوطني الاقتصادي والاجتماعي والبيئي، إطار للحوار والتشاور والاقتراح والاستشراف والتحليل في المجالات الاقتصادية والاجتماعية والبيئية، يوضع لدى رئيس الجمهورية.\nوهو كذلك مستشار الحكومة."
  },
  {
    "رقم الباب": 5,
    "اسم الباب": " الهيئات الاسـتـشـاريـة",
    "رقم الفصل": 3,
    "اسم الفصل": "المجلس الوطني الاقتصادي والاجتماعي والبيئي",
    "رقم المادة": 210,
    "نص المادة": "المادة 210\nيتولّى المجلس الوطني الاقتصادي والاجتماعي والبيئي، عـلى وجه الخصوص، مهمة:\n– توفير إطار لمشاركة المجتمع المدني في التشاور الوطني حول سياسات التنمية الاقتصادية والاجتماعية والبيئية في إطار التنمية المستدامة،\n– ضمان ديمومة الحوار والتشاور بين الشركاء الاقتصاديين والاجتماعيين الوطنيين،\n-تقييم المسائل ذات المصلحة الوطنية في المجال الاقتصادي والاجتماعي والبيئي والتربوي والتكويني والتعليم العالي ودراستها،\n– عرض اقتراحات وتوصيات على الحكومة."
  },
  {
    "رقم الباب": 5,
    "اسم الباب": " الهيئات الاسـتـشـاريـة",
    "رقم الفصل": 4,
    "اسم الفصل": "المجلس الوطني لحقوق الإنسان",
    "رقم المادة": 211,
    "نص المادة": "المادة 211\nالمجلس الوطني لحقوق الإنسان هيئة استشارية لدى رئيس الجمهورية.\nيتمتع المجلس بالاستقلالية الإدارية والمالية."
  },
  {
    "رقم الباب": 5,
    "اسم الباب": " الهيئات الاسـتـشـاريـة",
    "رقم الفصل": 4,
    "اسم الفصل": "المجلس الوطني لحقوق الإنسان",
    "رقم المادة": 212,
    "نص المادة": "المادة 212\nيتولّى المجلس مهمة الرقابة والإنذار المبكر والتقييم في مجال احترام حقوق الإنسان.\nيدرس المجلس، دون المساس بصلاحيات السلطة القضائية، كل حالات انتهاك حقوق الإنسان التي يعاينها أو تُبلغ إلى علمه، ويقوم بكل إجراء مناسب في هذا الشأن. ويعرض نتائج تحقيقاته على السلطات الإدارية المعنية، وإذا اقتضى الأمر، على الجهات القضائية المختصة.\nيبادر المجلس بأعمال التحسيس والإعلام والاتصال لترقية حقوق الإنسان.\nكما يبدي آراء واقتراحات وتوصيات تتعلق بترقية حقوق الإنسان وحمايتها.\nيعدّ المجلس تقريرا سنويا يرفعه إلى رئيس الجمهورية. ويتولى رئيس المجلس نشره.\nيحدد القانون تشكيلة المجلس وكيفيات تعيين أعضائه والقواعد المتعلقة بتنظيمه وسيره."
  },
  {
    "رقم الباب": 5,
    "اسم الباب": " الهيئات الاسـتـشـاريـة",
    "رقم الفصل": 5,
    "اسم الفصل": "المرصد الوطني للمجتمع المدني",
    "رقم المادة": 213,
    "نص المادة": "المادة 213\nالمرصد الوطني للمجتمع المدني هيئة استشارية لدى رئيس الجمهورية.\nيقدم المرصد آراء وتوصيات متعلقة بانشغالات المجتمع المدني.\nيساهم المرصد في ترقية القيم الوطنية والممارسة الديمقراطية والمواطنة ويشارك مع المؤسسات الأخرى في تحقيق أهداف التنمية الوطنية.\nيحدد رئيس الجمهورية تشكيلة المرصد ومهامه الأخرى."
  },
  {
    "رقم الباب": 5,
    "اسم الباب": " الهيئات الاسـتـشـاريـة",
    "رقم الفصل": 6,
    "اسم الفصل": "المجلس الأعلى للشباب ",
    "رقم المادة": 214,
    "نص المادة": "المادة 214\nالمجلس الأعلى للشباب هيئة استشارية لدى رئيس الجمهورية.\nيضمّ المجلس الأعلى للشباب ممثلين عن الشباب وممثلين عن الحكومة وعن المؤسسات العمومية المكلفة بشؤون الشباب.\nيحدد رئيس الجمهورية تشكيلة المجلس ومهامه الأخرى."
  },
  {
    "رقم الباب": 5,
    "اسم الباب": " الهيئات الاسـتـشـاريـة",
    "رقم الفصل": 6,
    "اسم الفصل": "المجلس الأعلى للشباب ",
    "رقم المادة": 215,
    "نص المادة": "المادة 215\nيقدم المجلس الأعلى للشباب آراء وتوصيات حول المسائل المتعلقة بحاجات الشباب وازدهاره في المجالات الاقتصادية، والاجتماعية، والثقافية والرياضية.\nيساهم المجلس الأعلى للشباب في ترقية القيم الوطنية والضمير الوطني والحس المدني والتضامن الاجتماعي في أوساط الشباب."
  },
  {
    "رقم الباب": 5,
    "اسم الباب": " الهيئات الاسـتـشـاريـة",
    "رقم الفصل": 7,
    "اسم الفصل": "المجلس الوطني للبحث العلمي والتكنولوجيات",
    "رقم المادة": 216,
    "نص المادة": "المادة 216\nالمجلس الوطني للبحث العلمي والتكنولوجيات هيئة استشارية."
  },
  {
    "رقم الباب": 5,
    "اسم الباب": " الهيئات الاسـتـشـاريـة",
    "رقم الفصل": 7,
    "اسم الفصل": "المجلس الوطني للبحث العلمي والتكنولوجيات",
    "رقم المادة": 217,
    "نص المادة": "المادة 217\nيتولّى المجلس، على الخصوص، المهام الآتية :\n– ترقية البحث الوطني في مجال الابتكار التكنولوجي والعلمي،\n– اقتراح التدابير الكفيلة بتنمية القدرات الوطنية في مجال البحث والتطوير،\n– تقييم فعالية الأجهزة الوطنية المتخصصة في تثمين نتائج البحث لفائدة الاقتصاد الوطني في إطار التنمية المستدامة.\nيعيّن رئيس الجمهورية رئيس المجلس الوطني للبحث العلمي والتكنولوجيات.\nيحدد القانون تنظيم المجلس وتشكيله وسيره وكذا صلاحياته."
  },
  {
    "رقم الباب": 5,
    "اسم الباب": " الهيئات الاسـتـشـاريـة",
    "رقم الفصل": 8,
    "اسم الفصل": "الأكاديمية الجزائرية للعلوم والتكنولوجيات",
    "رقم المادة": 218,
    "نص المادة": "المادة 218\nالأكاديمية الجزائرية للعلوم والتكنولوجيات هيئة مستقلة ذات طابع علمي وتكنولوجي.\nيحدد القانون تنظيم الأكاديمية وتشكيلتها وسيرها ومهامها."
  },

  {
    "رقم الباب": 6,
    "اسم الباب": "التعديل الدستوري",
    "رقم الفصل": 1,
    "اسم الفصل": "التعديل الدستوري",
    "رقم المادة": 219,
    "نص المادة": "المادة 219\nلرئيس الجمهوريّة حقّ المبادرة بالتّعديل الدّستوريّ.\nبعد أن يصوّت المجلس الشّعبيّ الوطنيّ ومجلس الأمّة على المبادرة بنفس الصّيغة حسب الشّروط نفسها الّتي تطبّق على نصّ تشريعيّ، يُعرض التّعديل على الشّعب للاستفتاء عليه خلال الخمسين (50) يوما الموالية لإقراره.\nيصدر رئيس الجمهوريّة التّعديل الدّستوريّ الّذي صادق عليه الشّعب."
  },
  {
    "رقم الباب": 6,
    "اسم الباب": "التعديل الدستوري",
    "رقم الفصل": 1,
    "اسم الفصل": "التعديل الدستوري",
    "رقم المادة": 220,
    "نص المادة": "المادة 220\nيصبح القانون الّذي يتضمّن مشروع التّعديل الدّستوريّ لاغيا، إذا رفضه الشّعب.\nولا يمكن عرضه من جديد على الشّعب خلال نفس الفترة التّشريعيّة."
  },
  {
    "رقم الباب": 6,
    "اسم الباب": "التعديل الدستوري",
    "رقم الفصل": 1,
    "اسم الفصل": "التعديل الدستوري",
    "رقم المادة": 221,
    "نص المادة": "المادة 221\nإذا ارتأت المحكمة الدّستـوريّة أنّ مشروع أيّ تعديـل دسـتوريّ لا يمسّ البتّة المبادئ العـامّة الّتي تحكم المجتمع الجزائريّ، وحقوق الإنـسان والـمـواطـن وحرّيّاتهما، ولا يمسّ بأيّ كيفيّة التّوازنات الأساسيّة للسّلطات والمؤسّسات الدّستوريّة، وعلّلت رأيها، أمكن رئيس الجمهوريّة أن يصدر القانون الّذي يتضمّن التّعديل الدّستوريّ مباشرة دون أن يَعرضه على الاستفتاء الشّعبيّ، متى أحرز ثلاثة أرباع (4/3) أصوات أعضاء غرفتي البرلمان."
  },
  {
    "رقم الباب": 6,
    "اسم الباب": "التعديل الدستوري",
    "رقم الفصل": 1,
    "اسم الفصل": "التعديل الدستوري",
    "رقم المادة": 222,
    "نص المادة": "المادة 222\nيمكن ثلاثة أرباع (4/3) أعضاء غرفتي البرلمان المجتمعين معا، أن يبادروا باقتراح تعديل الدّستور على رئيس الـجمهوريّة الذي يمكنه عرضه على الاستفتاء الشّعبيّ.\nويصدره في حالة الموافقة عليه."
  },
  {
    "رقم الباب": 6,
    "اسم الباب": "التعديل الدستوري",
    "رقم الفصل": 1,
    "اسم الفصل": "التعديل الدستوري",
    "رقم المادة": 223,
    "نص المادة": "المادة 223\nلا يمكن أيّ تعديل دستوريّ أن يمسّ:\n– الطّابع الجمهوريّ للدّولة،\n– النّظام الدّيمقراطيّ القائم على التّعدّديّة الحزبيّة،\n– الطابع الاجتماعي للدولة،\n– الإسلام باعتباره دين الدّولة،\n– العربيّة باعتبارها اللّغة الوطنيّة والرّسميّة،\n– تمازيغت كلغة وطنية ورسمية.\n– الحرّيّات الأساسيّة وحقوق الإنسان والمواطن،\n– سلامة التّراب الوطنيّ ووحدته،\n– العلم الوطني والنشيد الوطني باعتبارهما من رموز ثورة نوفمبر 1954 المجيدة والجمهورية والأمة،\n– عدم جواز تولي أكثر من عهدتين رئاسيتين متتاليتين أو منفصلتين ومدة كل عهدة خمس (5) سنوات."
  },
  {
    "رقم الباب": 6,
    "اسم الباب": "التعديل الدستوري",
    "رقم الفصل": 2,
    "اسم الفصل": "الأحكام الانـتـقـاليـة",
    "رقم المادة": 224,
    "نص المادة": "المادة : 224 تستمـر المؤسسات والهيئات التي طرأ على نظامها القانوني في هذا الدستور تعديل أو إلغاء في أداء مهامها إلى غاية تعويضها بالمؤسسات والهيئات الجديدة في أجل أقصاه سنة واحدة من تاريخ نشر هذا الدستور في الجريدة الرّسميّة."
  },
  {
    "رقم الباب": 6,
    "اسم الباب": "التعديل الدستوري",
    "رقم الفصل": 2,
    "اسم الفصل": "الأحكام الانـتـقـاليـة",
    "رقم المادة": 225,
    "نص المادة": "المادة 225 : يستمـر سريان مفعـول القوانين التي يستوجـب تعديلها أو إلغاؤها وفق أحكام هذا الدستور إلى غاية إعداد قوانين جديدة أو تعديلها في أجل معقول."
  }
]
